<template>
  <header>
    <div class="wrapper">
      
    <div class="title-wrapper">
      <h1 class="title">
        <span>跨国投资法律检索辅助系统</span>
      </h1>
    </div>

      <!-- <HelloWorld msg="You did it!" />

      <nav>
        <RouterLink to="/">Home</RouterLink>
        <RouterLink to="/about">About</RouterLink>
      </nav> -->

      <!-- 添加级联选择器 -->
      <div class="cascader-container">
        <el-cascader-panel v-model="value" :options="options" @change="handleCascaderChange" />
      </div>

      <!-- 添加文本条（在nav中），显示被选中的内容 -->
      <nav>
        <a v-if="selectedValue" :href="selectedValue" target="_blank">点击跳转、</a>
      </nav>

      <!-- <nav>
        <el-radio-group
          v-model="checkedNation"
          @change="handleCheckedNationChange"
        >
          <el-radio v-for="tag in nations" :key="tag" :label="tag">{{
            tag
          }}</el-radio>
        </el-radio-group>
      </nav>

      <nav>
        <el-checkbox
          v-model="checkAll"
          :indeterminate="isIndeterminate"
          @change="handleCheckAllChange"
          >全选</el-checkbox
        >
        <el-checkbox-group
          v-model="checkedItems"
          @change="handleCheckedItemsChange"
        >
          <el-checkbox v-for="tag in tags" :key="tag" :label="tag">{{
            tag
          }}</el-checkbox>
        </el-checkbox-group>
      </nav> -->

    </div>
  </header>

  <!-- <RouterView /> -->
</template>

<style scoped>
.cascader-container {
  /*   ***   */
  width: 1080px; /* 设置宽度为页面的80% */
  /* 其他样式规则 */
}

/* 可以为 el-cascader-panel 添加一些样式，以适应容器 */
.el-cascader-panel {
  /*   ***   */
  max-width: 1080px;
}

header {
  line-height: 1.5;
  max-height: 100vh;
}
.title-wrapper { display: flex; align-items: center;justify-content: center; } 
.title { font-size: 20px; margin: 0; } 
.title span { font-family: LiSu; font-size: 40px;  flex: 1; }
.logo {
  display: block;
  margin: 0 auto 2rem;
}

nav {
  width: 100%;
  font-size: 12px;
  text-align: center;
  margin-top: 2rem;
}

nav a.router-link-exact-active {
  color: var(--color-text);
}

nav a.router-link-exact-active:hover {
  background-color: transparent;
}

nav a {
  display: inline-block;
  padding: 0 1rem;
  border-left: 1px solid var(--color-border);
}

nav a:first-of-type {
  border: 0;
}

@media (min-width: 1024px) {
  header {
    display: flex;
    place-items: center;
    padding-right: calc(var(--section-gap) / 2);
  }

  .logo {
    margin: 0 2rem 0 0;
  }

  header .wrapper {
    display: flex;
    place-items: flex-start;
    flex-wrap: wrap;
  }
  .title-wrapper {
    width: 100%; /* 让标题占满父容器的宽度 */
    text-align: center; /* 居中文本 */
  }

  nav {
    text-align: left;
    margin-left: -1rem;
    font-size: 1rem;

    padding: 1rem 0;
    margin-top: 1rem;
  }
}
</style>

<script lang="ts" setup>
import { RouterLink, RouterView } from 'vue-router'
import { onMounted, ref, watch } from 'vue';
import HelloWorld from './components/HelloWorld.vue'

onMounted(() => {
  document.title ='跨国投资法律检索系统';
});

// // // 多选框相关
// const checkedNation = ref()
// const nations = ['中国', '欧盟', '俄罗斯']

// const checkAll = ref(false)
// const isIndeterminate = ref(true)
// const checkedItems = ref([''])
// const tags = ref([''])
// const tags0 = ['法律', '行政法规', '司法解释', '部门规章', '行业规定']
// const tags1 = ['法规', '条例', '决定', '建议和意见', '指令指南', '条约公约', '协议协定', '判例']
// const tags2 = ['联邦宪法和宪法性法律', '联邦规范性法律文件', '各联邦主体法律', '国际条约、国际法原则和准则', '俄罗斯总统法令', '政府行政法规']


// const handleCheckedNationChange = (value: string) => {
//   console.log(value)
//   if (value == '中国') {
//     tags.value = tags0
//   }
//   else if (value == '欧盟') {
//     tags.value = tags1
//   }
//   else {
//     tags.value = tags2
//   }
// }

// const handleCheckAllChange = (val: boolean) => {
//   checkedItems.value = val ? tags.value : []
//   isIndeterminate.value = false
// }
// const handleCheckedItemsChange = (value: string[]) => {
//   const checkedCount = value.length
//   checkAll.value = checkedCount === tags.value.length
//   isIndeterminate.value = checkedCount > 0 && checkedCount < tags.value.length
// }



// // // 条目列表相关
// 声明一个value，用于级联选择器默认及更新
const value = ref([])
// 声明一个 ref 变量，用于存储级联选择器选择的值，并且绑定到 el-text 中
const selectedValue = ref('');
const selectedLabel = ref('');

// 处理 el-cascader-panel 的 change 事件
const handleCascaderChange = (value: any, selectedOptions: any) => {
  var len = value.length;
  var txt = value[len-1];
  console.log(len, txt);  // 打印内容，不过没有必要、

  // 依照级联选择器的value，改变 el-text 的内容
  if (txt) {
    window.open(txt, '_blank')
    selectedValue.value = txt;
  }
};

const options = ref([
  {
    "value": "tip：各国分类层级（效力位阶）概览",
    "label": "tip：各国分类层级（效力位阶）概览",
    "children": [
      {
        "value": "中国1法律.2行政法规.3司法解释（目前未收录）.4部门规章（含：部门规章，部门规范性文件，部门工文件，行政许可批复）.5行业、团体规定",
        "label": "中国1法律.2行政法规.3司法解释（目前未收录）.4部门规章（含：部门规章，部门规范性文件，部门工文件，行政许可批复）.5行业、团体规定"
      },
      {
        "value": "欧盟 1.法规2.条例3.决定4.建议和意见，指令指南5.条约公约6.协议协定7.判例",
        "label": "欧盟 1.法规2.条例3.决定4.建议和意见，指令指南5.条约公约6.协议协定7.判例"
      },
      {
        "value": "俄罗斯1联邦宪法和宪法性法律2联邦规范性法律文件3各联邦主体法律4国际条约、国际法原则和准则5俄罗斯总统法令6政府行政法规",
        "label": "俄罗斯1联邦宪法和宪法性法律2联邦规范性法律文件3各联邦主体法律4国际条约、国际法原则和准则5俄罗斯总统法令6政府行政法规"
      },
      {
        "value": "美国：以内容分类为主，效力位阶难以分类（个别区分联邦、州）",
        "label": "美国：以内容分类为主，效力位阶难以分类（个别区分联邦、州）"
      }
    ]
  },
  {
    "value": "内容分类概览：",
    "label": "内容分类概览：",
    "children": [
      {
        "value": "投资法律制度",
        "label": "投资法律制度"
      },
      {
        "value": "贸易法律制度",
        "label": "贸易法律制度"
      },
      {
        "value": "公司设立法律制度",
        "label": "公司设立法律制度"
      },
      {
        "value": "税收法律制度",
        "label": "税收法律制度"
      },
      {
        "value": "劳动就业",
        "label": "劳动就业"
      },
      {
        "value": "工程承包法律制度",
        "label": "工程承包法律制度"
      },
      {
        "value": "土地法律制度",
        "label": "土地法律制度"
      },
      {
        "value": "环境保护制度",
        "label": "环境保护制度"
      },
      {
        "value": "土地法律制度：",
        "label": "土地法律制度："
      },
      {
        "value": "知识产权",
        "label": "知识产权"
      },
      {
        "value": "争议解决",
        "label": "争议解决"
      },
      {
        "value": "反垄断",
        "label": "反垄断"
      },
      {
        "value": "安全",
        "label": "安全"
      }
    ]
  },
  {
    "value": "中国：",
    "label": "中国：",
    "children": [
      {
        "value": "投资法律制度",
        "label": "投资法律制度",
        "children": [
          {
            "value": "行政法规",
            "label": "行政法规",
            "children": [
              {
                "value": "国务院办公厅转发国家发展改革委商务部人民银行外交部关于进一步引导和规范境外投资方向指导意见的通知",
                "label": "国务院办公厅转发国家发展改革委商务部人民银行外交部关于进一步引导和规范境外投资方向指导意见的通知"
              }
            ]
          },
          {
            "value": "部门规章",
            "label": "部门规章",
            "children": [
              {
                "value": "企业境外投资管理办法",
                "label": "企业境外投资管理办法"
              },
              {
                "value": "中央企业境外投资监督管理办法",
                "label": "中央企业境外投资监督管理办法"
              },
              {
                "value": "境外投资管理办法(2014)",
                "label": "境外投资管理办法(2014)"
              },
              {
                "value": "保险资金境外投资管理暂行办法",
                "label": "保险资金境外投资管理暂行办法"
              },
              {
                "value": "烟草行业企业境外投资项目管理办法",
                "label": "烟草行业企业境外投资项目管理办法"
              },
              {
                "value": "国家计委关于印发《关于编制、审批境外投资项目的项目建议书和可行性研究报告的规定》的通知",
                "label": "国家计委关于印发《关于编制、审批境外投资项目的项目建议书和可行性研究报告的规定》的通知"
              },
              {
                "value": "财政部关于印发《国有企业境外投资直派财务负责人管理办法》的通知",
                "label": "财政部关于印发《国有企业境外投资直派财务负责人管理办法》的通知"
              },
              {
                "value": "国家发展改革委关于发布企业境外投资管理办法配套格式文本(2018年版)的通知",
                "label": "国家发展改革委关于发布企业境外投资管理办法配套格式文本(2018年版)的通知"
              },
              {
                "value": "国家发展改革委、商务部、人民银行等关于发布《民营企业境外投资经营行为规范》的通知",
                "label": "国家发展改革委、商务部、人民银行等关于发布《民营企业境外投资经营行为规范》的通知"
              },
              {
                "value": "财政部关于印发《国有企业境外投资财务管理办法》的通知",
                "label": "财政部关于印发《国有企业境外投资财务管理办法》的通知"
              },
              {
                "value": "商务部办公厅关于境外投资备案实行无纸化管理和简化境外投资注销手续的通知",
                "label": "商务部办公厅关于境外投资备案实行无纸化管理和简化境外投资注销手续的通知"
              },
              {
                "value": "中国保监会关于调整保险资金境外投资有关政策的通知",
                "label": "中国保监会关于调整保险资金境外投资有关政策的通知"
              },
              {
                "value": "商务部办公厅关于做好境外投资管理工作的通知",
                "label": "商务部办公厅关于做好境外投资管理工作的通知"
              },
              {
                "value": "交通运输部办公厅关于鼓励和引导水运行业民营企业境外投资和跨国经营的若干意见",
                "label": "交通运输部办公厅关于鼓励和引导水运行业民营企业境外投资和跨国经营的若干意见"
              },
              {
                "value": "商务部办公厅关于涉及多国利益境外投资有关事项的通知",
                "label": "商务部办公厅关于涉及多国利益境外投资有关事项的通知"
              },
              {
                "value": "财政部关于规范国有企业境外投资中个人代持股份有关问题的通知",
                "label": "财政部关于规范国有企业境外投资中个人代持股份有关问题的通知"
              },
              {
                "value": "商务部、国家外汇管理局关于境外投资联合年检工作有关事项的通知",
                "label": "商务部、国家外汇管理局关于境外投资联合年检工作有关事项的通知"
              },
              {
                "value": "中国保险监督管理委员会关于中国财产再保险股份有限公司境外投资备案的通知",
                "label": "中国保险监督管理委员会关于中国财产再保险股份有限公司境外投资备案的通知"
              },
              {
                "value": "财政部关于印发《中央国有资本经营预算境外投资资金管理暂行办法》的通知",
                "label": "财政部关于印发《中央国有资本经营预算境外投资资金管理暂行办法》的通知"
              },
              {
                "value": "商务部办公厅、住房和城乡建设部办公厅、国家安全生产监管总局办公厅关于进一步加强境外投资合作项目安全生产工作的紧急通知",
                "label": "商务部办公厅、住房和城乡建设部办公厅、国家安全生产监管总局办公厅关于进一步加强境外投资合作项目安全生产工作的紧急通知"
              },
              {
                "value": "商务部关于做好境外投资管理工作有关事项的通知",
                "label": "商务部关于做好境外投资管理工作有关事项的通知"
              },
              {
                "value": "商务部办公厅关于启用“境外投资管理系统”和《企业境外投资证书》、《企业境外机构证书》等有关事项的通知",
                "label": "商务部办公厅关于启用“境外投资管理系统”和《企业境外投资证书》、《企业境外机构证书》等有关事项的通知"
              },
              {
                "value": "商务部办公厅关于调整境外投资核准有关事项的通知",
                "label": "商务部办公厅关于调整境外投资核准有关事项的通知"
              },
              {
                "value": "中国银监会办公厅关于进一步调整商业银行代客境外理财业务境外投资有关规定的通知",
                "label": "中国银监会办公厅关于进一步调整商业银行代客境外理财业务境外投资有关规定的通知"
              },
              {
                "value": "中国银监会办公厅关于调整信托公司受托境外理财业务境外投资范围的通知",
                "label": "中国银监会办公厅关于调整信托公司受托境外理财业务境外投资范围的通知"
              },
              {
                "value": "中国银监会办公厅关于调整商业银行代客境外理财业务境外投资范围的通知",
                "label": "中国银监会办公厅关于调整商业银行代客境外理财业务境外投资范围的通知"
              },
              {
                "value": "国家发展和改革委员会、商务部、外交部等关于印发《境外投资产业指导政策》的通知",
                "label": "国家发展和改革委员会、商务部、外交部等关于印发《境外投资产业指导政策》的通知"
              },
              {
                "value": "全国社会保障基金境外投资管理暂行规定",
                "label": "全国社会保障基金境外投资管理暂行规定"
              },
              {
                "value": "商务部关于印发《境外投资开办企业核准工作细则》的通知",
                "label": "商务部关于印发《境外投资开办企业核准工作细则》的通知"
              },
              {
                "value": "国家发展和改革委员会、国家开发银行关于进一步加强对境外投资重点项目融资支持有关问题的通知",
                "label": "国家发展和改革委员会、国家开发银行关于进一步加强对境外投资重点项目融资支持有关问题的通知"
              },
              {
                "value": "国家发展和改革委员会、中国出口信用保险公司关于建立境外投资重点项目风险保障机制有关问题的通知",
                "label": "国家发展和改革委员会、中国出口信用保险公司关于建立境外投资重点项目风险保障机制有关问题的通知"
              },
              {
                "value": "国家发展改革委、中国进出口银行关于对国家鼓励的境外投资重点项目给予信贷支持政策的通知",
                "label": "国家发展改革委、中国进出口银行关于对国家鼓励的境外投资重点项目给予信贷支持政策的通知"
              },
              {
                "value": "商务部关于做好境外投资审批试点工作有关问题的通知",
                "label": "商务部关于做好境外投资审批试点工作有关问题的通知"
              },
              {
                "value": "外经贸部关于印发《境外投资综合绩效评价办法(试行)》的通知",
                "label": "外经贸部关于印发《境外投资综合绩效评价办法(试行)》的通知"
              },
              {
                "value": "“十二五”利用外资和境外投资规划",
                "label": "“十二五”利用外资和境外投资规划"
              },
              {
                "value": "国家发展改革委、外交部、工业和信息化部等关于印发鼓励和引导民营企业积极开展境外投资的实施意见的通知",
                "label": "国家发展改革委、外交部、工业和信息化部等关于印发鼓励和引导民营企业积极开展境外投资的实施意见的通知"
              },
              {
                "value": "商务部办公厅关于启用《中国企业境外投资批准证书》的通知",
                "label": "商务部办公厅关于启用《中国企业境外投资批准证书》的通知"
              },
              {
                "value": "商务部办公厅关于启用《中华人民共和国境外投资批准证书》的通知",
                "label": "商务部办公厅关于启用《中华人民共和国境外投资批准证书》的通知"
              },
              {
                "value": "“十五”利用外资和境外投资规划",
                "label": "“十五”利用外资和境外投资规划"
              },
              {
                "value": "中国银保监会关于允许境外投资者来华经营保险代理业务的通知",
                "label": "中国银保监会关于允许境外投资者来华经营保险代理业务的通知"
              },
              {
                "value": "中国银保监会关于允许境外投资者来华经营保险公估业务的通知",
                "label": "中国银保监会关于允许境外投资者来华经营保险公估业务的通知"
              },
              {
                "value": "中国人民银行关于境外投资者投资境内金融机构人民币结算有关事项的通知",
                "label": "中国人民银行关于境外投资者投资境内金融机构人民币结算有关事项的通知"
              },
              {
                "value": "国家发展改革委办公厅关于外商投资项目和境外投资项目核准有关问题的复函",
                "label": "国家发展改革委办公厅关于外商投资项目和境外投资项目核准有关问题的复函"
              },
              {
                "value": "国家发展和改革委员会办公厅关于启用全国境外投资项目备案管理网络系统的通知",
                "label": "国家发展和改革委员会办公厅关于启用全国境外投资项目备案管理网络系统的通知"
              },
              {
                "value": "国家税务总局关于扩大境外投资者以分配利润直接投资暂不征收预提所得税政策适用范围有关问题的公告",
                "label": "国家税务总局关于扩大境外投资者以分配利润直接投资暂不征收预提所得税政策适用范围有关问题的公告"
              },
              {
                "value": "财政部、税务总局、国家发展改革委、商务部关于扩大境外投资者以分配利润直接投资暂不征收预提所得税政策适用范围的通知",
                "label": "财政部、税务总局、国家发展改革委、商务部关于扩大境外投资者以分配利润直接投资暂不征收预提所得税政策适用范围的通知"
              },
              {
                "value": "国家发展改革委利用外资和境外投资司关于不再办理《符合国家产业政策的外商投资项目确认书》的通知",
                "label": "国家发展改革委利用外资和境外投资司关于不再办理《符合国家产业政策的外商投资项目确认书》的通知"
              },
              {
                "value": "中国人民银行关于境外投资者因经营受让不良债权开立人民币银行结算账户有关问题的通知",
                "label": "中国人民银行关于境外投资者因经营受让不良债权开立人民币银行结算账户有关问题的通知"
              },
              {
                "value": "财政部关于贯彻落实《国务院关于暂停收购境外企业和进一步加强境外投资管理的通知》的紧急通知",
                "label": "财政部关于贯彻落实《国务院关于暂停收购境外企业和进一步加强境外投资管理的通知》的紧急通知"
              },
              {
                "value": "中国人民银行上海总部公告(2017)第1号——关于中国人民银行上海总部制定了《“债券通“北向通境外投资者准入备案业务指引》的公告",
                "label": "中国人民银行上海总部公告(2017)第1号——关于中国人民银行上海总部制定了《“债券通“北向通境外投资者准入备案业务指引》的公告"
              }
            ]
          }
        ]
      },
      {
        "value": "贸易法律制度",
        "label": "贸易法律制度",
        "children": [
          {
            "value": "法律",
            "label": "法律",
            "children": [
              {
                "value": "中央人民政府委员会关于批准海关与对外贸易管理机关实行合并的决议",
                "label": "中央人民政府委员会关于批准海关与对外贸易管理机关实行合并的决议"
              },
              {
                "value": "中华人民共和国对外贸易法(2022修正)",
                "label": "中华人民共和国对外贸易法(2022修正)"
              }
            ]
          },
          {
            "value": "行政法规",
            "label": "行政法规",
            "children": [
              {
                "value": "国务院关于“十四五”对外贸易高质量发展规划的批复",
                "label": "国务院关于“十四五”对外贸易高质量发展规划的批复"
              },
              {
                "value": "国务院办公厅关于推进对外贸易创新发展的实施意见",
                "label": "国务院办公厅关于推进对外贸易创新发展的实施意见"
              },
              {
                "value": "国务院关于加强进口促进对外贸易平衡发展的指导意见",
                "label": "国务院关于加强进口促进对外贸易平衡发展的指导意见"
              },
              {
                "value": "国务院办公厅关于印发对外贸易经济合作部职能配置内设机构和人员编制规定的通知(1998)",
                "label": "国务院办公厅关于印发对外贸易经济合作部职能配置内设机构和人员编制规定的通知(1998)"
              },
              {
                "value": "国务院关于设立中央对外贸易发展基金有关问题的批复",
                "label": "国务院关于设立中央对外贸易发展基金有关问题的批复"
              },
              {
                "value": "国务院办公厅关于印发对外贸易经济合作部、国家进出口商品检验局职能配置、内设机构和人员编制方案的通知",
                "label": "国务院办公厅关于印发对外贸易经济合作部、国家进出口商品检验局职能配置、内设机构和人员编制方案的通知"
              },
              {
                "value": "国务院关于进一步改革和完善对外贸易体制若干问题的决定",
                "label": "国务院关于进一步改革和完善对外贸易体制若干问题的决定"
              },
              {
                "value": "国务院关于同意向关税和贸易总协定递交《中国对外贸易制度备忘录》的批复",
                "label": "国务院关于同意向关税和贸易总协定递交《中国对外贸易制度备忘录》的批复"
              }
            ]
          },
          {
            "value": "部门规章",
            "label": "部门规章",
            "children": [
              {
                "value": "对外贸易经营者备案登记办法(2021修订)",
                "label": "对外贸易经营者备案登记办法(2021修订)"
              },
              {
                "value": "对外贸易经营者违法违规行为公告办法",
                "label": "对外贸易经营者违法违规行为公告办法"
              },
              {
                "value": "对外贸易经济合作部关于保障措施产品范围调整程序的暂行规则",
                "label": "对外贸易经济合作部关于保障措施产品范围调整程序的暂行规则"
              },
              {
                "value": "对外贸易经济合作部关于反倾销产品范围调整程序的暂行规则",
                "label": "对外贸易经济合作部关于反倾销产品范围调整程序的暂行规则"
              },
              {
                "value": "外经贸部第四批废止的部门规章目录（中华人民共和国对外贸易经济合作部令2002年第24号）",
                "label": "外经贸部第四批废止的部门规章目录（中华人民共和国对外贸易经济合作部令2002年第24号）"
              },
              {
                "value": "对外贸易经济合作部、海关总署关于对走私、违规企业给予警告或暂停、撤销对外贸易、国际货运代理经营许可行政处罚的规定",
                "label": "对外贸易经济合作部、海关总署关于对走私、违规企业给予警告或暂停、撤销对外贸易、国际货运代理经营许可行政处罚的规定"
              },
              {
                "value": "中华人民共和国对外贸易经济合作部保障措施调查听证会暂行规则",
                "label": "中华人民共和国对外贸易经济合作部保障措施调查听证会暂行规则"
              },
              {
                "value": "外经贸部第二批废止部门规章目录(中华人民共和国对外贸易经济合作部令2001年第30号)",
                "label": "外经贸部第二批废止部门规章目录(中华人民共和国对外贸易经济合作部令2001年第30号)"
              },
              {
                "value": "对外贸易经济合作部和国家工商行政管理总局关于修改《关于外商投资企业合并与分立的规定》的决定",
                "label": "对外贸易经济合作部和国家工商行政管理总局关于修改《关于外商投资企业合并与分立的规定》的决定"
              },
              {
                "value": "外经贸部第一批废止部门规章目录（中华人民共和国对外贸易经济合作部令２００１年第１３号）",
                "label": "外经贸部第一批废止部门规章目录（中华人民共和国对外贸易经济合作部令２００１年第１３号）"
              },
              {
                "value": "对外贸易经济合作部关于印发《出口考核暂行办法》的通知",
                "label": "对外贸易经济合作部关于印发《出口考核暂行办法》的通知"
              }
            ]
          }
        ]
      },
      {
        "value": "公司设立法律制度",
        "label": "公司设立法律制度",
        "children": [
          {
            "value": "部门规章",
            "label": "部门规章",
            "children": [
              {
                "value": "证券公司和证券投资基金管理公司境外设立、收购、参股经营机构管理办法(2021修正)",
                "label": "证券公司和证券投资基金管理公司境外设立、收购、参股经营机构管理办法(2021修正)"
              },
              {
                "value": "保险公司设立境外保险类机构管理办法(2015修订)",
                "label": "保险公司设立境外保险类机构管理办法(2015修订)"
              },
              {
                "value": "对外贸易经济合作部关于印发《关于设立境外贸易公司和贸易代表处的暂行规定》的通知",
                "label": "对外贸易经济合作部关于印发《关于设立境外贸易公司和贸易代表处的暂行规定》的通知"
              },
              {
                "value": "【行政许可事项服务指南】证券公司在境外设立、收购或者参股证券经营机构审批",
                "label": "【行政许可事项服务指南】证券公司在境外设立、收购或者参股证券经营机构审批"
              },
              {
                "value": "中国证券监督管理委员会公告〔2017〕7号—关于取消期货公司设立、收购、参股境外期货类经营机构行政审批事项的决定",
                "label": "中国证券监督管理委员会公告〔2017〕7号—关于取消期货公司设立、收购、参股境外期货类经营机构行政审批事项的决定"
              }
            ]
          },
          {
            "value": "行业规定",
            "label": "行业规定",
            "children": [
              {
                "value": "中国证券业协会关于举办证券公司境外设立、收购、参股经营机构管理办法培训班的通知",
                "label": "中国证券业协会关于举办证券公司境外设立、收购、参股经营机构管理办法培训班的通知"
              },
              {
                "value": "中国人民保险(集团)公司关于分公司不得在境外设立机构的通知",
                "label": "中国人民保险(集团)公司关于分公司不得在境外设立机构的通知"
              }
            ]
          }
        ]
      },
      {
        "value": "工程承包法律制度",
        "label": "工程承包法律制度",
        "children": [
          {
            "value": "行政法规",
            "label": "行政法规",
            "children": [
              {
                "value": "对外承包工程管理条例(2017修订)",
                "label": "对外承包工程管理条例(2017修订)"
              },
              {
                "value": "国务院办公厅转发外经贸部等部门关于大力发展对外承包工程意见的通知",
                "label": "国务院办公厅转发外经贸部等部门关于大力发展对外承包工程意见的通知"
              }
            ]
          },
          {
            "value": "部门规章",
            "label": "部门规章",
            "children": [
              {
                "value": "商务部关于印发《对外承包工程业务统计调查制度》和《对外劳务合作业务统计调查制度》的通知(2021修订)",
                "label": "商务部关于印发《对外承包工程业务统计调查制度》和《对外劳务合作业务统计调查制度》的通知(2021修订)"
              },
              {
                "value": "商务部、外交部、发展改革委等关于促进对外承包工程高质量发展的指导意见",
                "label": "商务部、外交部、发展改革委等关于促进对外承包工程高质量发展的指导意见"
              },
              {
                "value": "商务部办公厅关于请继续做好对外承包工程领域应对新冠肺炎疫情有关工作的通知",
                "label": "商务部办公厅关于请继续做好对外承包工程领域应对新冠肺炎疫情有关工作的通知"
              },
              {
                "value": "商务部办公厅、海关总署办公厅、质检总局办公厅关于做好对外承包工程资格审批取消后有关政策衔接工作的通知",
                "label": "商务部办公厅、海关总署办公厅、质检总局办公厅关于做好对外承包工程资格审批取消后有关政策衔接工作的通知"
              },
              {
                "value": "商务部关于印发《对外承包工程行业社会责任指引》的通知",
                "label": "商务部关于印发《对外承包工程行业社会责任指引》的通知"
              },
              {
                "value": "商务部关于做好《对外承包工程资格证书》到期换领有关工作的通知",
                "label": "商务部关于做好《对外承包工程资格证书》到期换领有关工作的通知"
              },
              {
                "value": "商务部、住房城乡建设部、安全监管总局关于印发《对外承包工程违法违规行为行政处罚规定》的通知",
                "label": "商务部、住房城乡建设部、安全监管总局关于印发《对外承包工程违法违规行为行政处罚规定》的通知"
              },
              {
                "value": "财政部办公厅、商务部办公厅关于在有关国家开展对外承包工程保函风险专项资金试点工作的通知",
                "label": "财政部办公厅、商务部办公厅关于在有关国家开展对外承包工程保函风险专项资金试点工作的通知"
              },
              {
                "value": "商务部办公厅关于进一步强调对外承包工程项下外派劳务工作有关问题的紧急通知",
                "label": "商务部办公厅关于进一步强调对外承包工程项下外派劳务工作有关问题的紧急通知"
              },
              {
                "value": "国家税务总局关于对外承包工程建筑幕墙所用材料登记备案问题的批复",
                "label": "国家税务总局关于对外承包工程建筑幕墙所用材料登记备案问题的批复"
              },
              {
                "value": "商务部关于印发进一步规范对外承包工程业务发展的规定的通知",
                "label": "商务部关于印发进一步规范对外承包工程业务发展的规定的通知"
              },
              {
                "value": "商务部关于印发《对外承包工程项下外派劳务管理暂行办法》的通知",
                "label": "商务部关于印发《对外承包工程项下外派劳务管理暂行办法》的通知"
              },
              {
                "value": "财政部、商务部关于印发《对外承包工程保函风险专项资金管理暂行办法》补充规定的通知",
                "label": "财政部、商务部关于印发《对外承包工程保函风险专项资金管理暂行办法》补充规定的通知"
              },
              {
                "value": "对外贸易经济合作部、海关总署关于印发《关于对外承包工程项下出口设备材料的工作规程》补充规定的通知",
                "label": "对外贸易经济合作部、海关总署关于印发《关于对外承包工程项下出口设备材料的工作规程》补充规定的通知"
              },
              {
                "value": "对外承包工程保函风险专项资金管理暂行办法",
                "label": "对外承包工程保函风险专项资金管理暂行办法"
              },
              {
                "value": "中国对外承包工程商会关于进一步做好外派海员劳务合作业务协调工作的通知",
                "label": "中国对外承包工程商会关于进一步做好外派海员劳务合作业务协调工作的通知"
              },
              {
                "value": "外经贸部关于利用出口信贷开展对外承包工程和成套设备出口实行资格审定有关问题的补充通知",
                "label": "外经贸部关于利用出口信贷开展对外承包工程和成套设备出口实行资格审定有关问题的补充通知"
              },
              {
                "value": "对外经济贸易部关于对外承包工程和劳务合作统计制度",
                "label": "对外经济贸易部关于对外承包工程和劳务合作统计制度"
              },
              {
                "value": "中国人民银行、对外经济贸易部关于争取对外承包工程和劳务合作在国内保险的通知",
                "label": "中国人民银行、对外经济贸易部关于争取对外承包工程和劳务合作在国内保险的通知"
              }
            ]
          },
          {
            "value": "行业规定",
            "label": "行业规定",
            "children": [
              {
                "value": "中国对外承包工程和劳务合作行业规范（试行）",
                "label": "中国对外承包工程和劳务合作行业规范（试行）"
              },
              {
                "value": "中国进出口银行关于印发《中国进出口银行对外承包工程项目贷款管理暂行办法》的通知",
                "label": "中国进出口银行关于印发《中国进出口银行对外承包工程项目贷款管理暂行办法》的通知"
              },
              {
                "value": "对外承包工程项目投（议）标协调办法实施细则",
                "label": "对外承包工程项目投（议）标协调办法实施细则"
              }
            ]
          }
        ]
      },
      {
        "value": "土地法律制度",
        "label": "土地法律制度",
        "children": [
          {
            "value": "部门规章",
            "label": "部门规章",
            "children": [
              {
                "value": "国家税务总局关于外商投资企业征免土地使用税问题的批复",
                "label": "国家税务总局关于外商投资企业征免土地使用税问题的批复"
              },
              {
                "value": "国家税务总局关于外商投资企业租用场地缴纳土地使用费列支问题的函",
                "label": "国家税务总局关于外商投资企业租用场地缴纳土地使用费列支问题的函"
              },
              {
                "value": "财政部关于外商投资企业租用场地如何缴土地使用费问题的答复",
                "label": "财政部关于外商投资企业租用场地如何缴土地使用费问题的答复"
              },
              {
                "value": "国家税务局关于对外商投资企业从事土地开发和使用权有偿转让征收工商统一税和企业所得税问题的通知",
                "label": "国家税务局关于对外商投资企业从事土地开发和使用权有偿转让征收工商统一税和企业所得税问题的通知"
              }
            ]
          }
        ]
      },
      {
        "value": "税收法律制度",
        "label": "税收法律制度",
        "children": [
          {
            "value": "1.法律:",
            "label": "1.法律:",
            "children": [
              {
                "value": "·《中华人民共和国企业所得税法》",
                "label": "·《中华人民共和国企业所得税法》"
              },
              {
                "value": "·中华人民共和国税收征收管理法(2015修正))",
                "label": "·中华人民共和国税收征收管理法(2015修正))"
              },
              {
                "value": "·全国人民代表大会常务委员会关于修改《中华人民共和国港口法》等七部法律的决定(含：税收征收管理法、固体废物污染环境防治法、枪支管理法、防洪法、证券投资基金法、城乡规划法)",
                "label": "·全国人民代表大会常务委员会关于修改《中华人民共和国港口法》等七部法律的决定(含：税收征收管理法、固体废物污染环境防治法、枪支管理法、防洪法、证券投资基金法、城乡规划法)"
              },
              {
                "value": "·全国人民代表大会常务委员会关于批准《多边税收征管互助公约》的决定",
                "label": "·全国人民代表大会常务委员会关于批准《多边税收征管互助公约》的决定"
              }
            ]
          },
          {
            "value": "2.行政法规",
            "label": "2.行政法规",
            "children": [
              {
                "value": "·中华人民共和国税收征收管理法实施细则(2016修订)",
                "label": "·中华人民共和国税收征收管理法实施细则(2016修订)"
              },
              {
                "value": "·外国在华常住人员携带进境物品进口税收暂行规定",
                "label": "·外国在华常住人员携带进境物品进口税收暂行规定"
              },
              {
                "value": "·暂行条例有关问题的通知",
                "label": "·暂行条例有关问题的通知"
              },
              {
                "value": "·国务院办公厅关于1996年3月31日前批准的外商投资企业进口税收政策的通知",
                "label": "·国务院办公厅关于1996年3月31日前批准的外商投资企业进口税收政策的通知"
              }
            ]
          },
          {
            "value": "3.部门规章",
            "label": "3.部门规章",
            "children": [
              {
                "value": "·规定》等3部规章的决定中华人民共和国财政部、中华人民共和国海关总署、国家税务总局关于废止《科学研究和教学用品免征进口税收规定》等3部规章的决定",
                "label": "·规定》等3部规章的决定中华人民共和国财政部、中华人民共和国海关总署、国家税务总局关于废止《科学研究和教学用品免征进口税收规定》等3部规章的决定"
              },
              {
                "value": "·财政部、国家税务总局关于跨境电子商务零售出口税收政策的通知",
                "label": "·财政部、国家税务总局关于跨境电子商务零售出口税收政策的通知"
              },
              {
                "value": "·国家税务总局进出口税收管理司、海关总署监管司关于使用新疆棉生产出口产品退税工作的补充通知",
                "label": "·国家税务总局进出口税收管理司、海关总署监管司关于使用新疆棉生产出口产品退税工作的补充通知"
              },
              {
                "value": "·国家税务总局关于做好我国企业境外投资税收服务与管理工作的意见",
                "label": "·国家税务总局关于做好我国企业境外投资税收服务与管理工作的意见"
              },
              {
                "value": "·财政部、税务总局关于境外所得有关个人所得税政策的公告",
                "label": "·财政部、税务总局关于境外所得有关个人所得税政策的公告"
              }
            ]
          },
          {
            "value": "4地方法规",
            "label": "4地方法规",
            "children": [
              {
                "value": "（1）地方规范性文件",
                "label": "（1）地方规范性文件",
                "children": [
                  {
                    "value": "·江苏省国家税务局关于转发《国家税务总局关于做好我国企业境外投资税收服务与管理工作的意见》的通知",
                    "label": "·江苏省国家税务局关于转发《国家税务总局关于做好我国企业境外投资税收服务与管理工作的意见》的通知"
                  },
                  {
                    "value": "·重庆市地方税务局转发国家税务总局关于做好我国企业境外投资税收服务与管理工作的意见的通知",
                    "label": "·重庆市地方税务局转发国家税务总局关于做好我国企业境外投资税收服务与管理工作的意见的通知"
                  },
                  {
                    "value": "·福建省地方税务局转发国家税务总局关于做好我国企业境外投资税收服务与管理工作的意见的通知",
                    "label": "·福建省地方税务局转发国家税务总局关于做好我国企业境外投资税收服务与管理工作的意见的通知"
                  },
                  {
                    "value": "·湖北省国家税务局转发国家税务总局关于做好我国企业境外投资税收服务与管理工作的意见的通知",
                    "label": "·湖北省国家税务局转发国家税务总局关于做好我国企业境外投资税收服务与管理工作的意见的通知"
                  }
                ]
              },
              {
                "value": "（2）地方工作文件",
                "label": "（2）地方工作文件",
                "children": [
                  {
                    "value": "·国家税务总局天津市税务局关于公开采购法国等国家投资税收指南服务项目的公告",
                    "label": "·国家税务总局天津市税务局关于公开采购法国等国家投资税收指南服务项目的公告"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "value": "劳动就业",
        "label": "劳动就业",
        "children": [
          {
            "value": "法律",
            "label": "法律",
            "children": [
              {
                "value": "《中华人民共和国劳动合同法》",
                "label": "《中华人民共和国劳动合同法》"
              }
            ]
          },
          {
            "value": "行政法规",
            "label": "行政法规",
            "children": [
              {
                "value": "劳动就业服务企业管理规定",
                "label": "劳动就业服务企业管理规定"
              }
            ]
          },
          {
            "value": "司法解释",
            "label": "司法解释",
            "children": [
              {
                "value": "最高人民法院关于人民法院对经劳动争议仲裁裁决的纠纷准予撤诉或驳回起诉后劳动争议仲裁裁决从何时起生效的解释",
                "label": "最高人民法院关于人民法院对经劳动争议仲裁裁决的纠纷准予撤诉或驳回起诉后劳动争议仲裁裁决从何时起生效的解释"
              }
            ]
          },
          {
            "value": "部门规章",
            "label": "部门规章",
            "children": [
              {
                "value": "劳动就业服务企业产权界定规定",
                "label": "劳动就业服务企业产权界定规定"
              },
              {
                "value": "劳动就业服务企业实行股份合作制规定",
                "label": "劳动就业服务企业实行股份合作制规定"
              },
              {
                "value": "能源部关于印发《电力行业劳动就业服务企业管理办法》的通知",
                "label": "能源部关于印发《电力行业劳动就业服务企业管理办法》的通知"
              },
              {
                "value": "电力行业劳动就业服务企业管理办法",
                "label": "电力行业劳动就业服务企业管理办法"
              },
              {
                "value": "化学工业劳动就业服务企业管理办法",
                "label": "化学工业劳动就业服务企业管理办法"
              },
              {
                "value": "广播电影电视部直属单位劳动就业服务企业管理办法",
                "label": "广播电影电视部直属单位劳动就业服务企业管理办法"
              },
              {
                "value": "邮电部门劳动就业服务企业管理试行办法",
                "label": "邮电部门劳动就业服务企业管理试行办法"
              }
            ]
          }
        ]
      },
      {
        "value": "环境保护",
        "label": "环境保护",
        "children": [
          {
            "value": "1法律",
            "label": "1法律",
            "children": [
              {
                "value": "中华人民共和国环境保护税法",
                "label": "中华人民共和国环境保护税法"
              },
              {
                "value": "中华人民共和国海洋环境保护法",
                "label": "中华人民共和国海洋环境保护法"
              }
            ]
          },
          {
            "value": "行政法规",
            "label": "行政法规",
            "children": [
              {
                "value": "中华人民共和国环境保护税法实施条例",
                "label": "中华人民共和国环境保护税法实施条例"
              },
              {
                "value": "建设项目环境保护管理条例(2017修订)",
                "label": "建设项目环境保护管理条例(2017修订)"
              }
            ]
          },
          {
            "value": "部门规章",
            "label": "部门规章",
            "children": [
              {
                "value": "管理规定",
                "label": "管理规定"
              },
              {
                "value": "中央企业节约能源与生态环境保护监督管理办法",
                "label": "中央企业节约能源与生态环境保护监督管理办法"
              }
            ]
          }
        ]
      },
      {
        "value": "知识产权",
        "label": "知识产权",
        "children": [
          {
            "value": "1法律",
            "label": "1法律",
            "children": [
              {
                "value": "中华人民共和国知识产权海关保护条例(2018修订)",
                "label": "中华人民共和国知识产权海关保护条例(2018修订)"
              }
            ]
          },
          {
            "value": "2行政法规",
            "label": "2行政法规",
            "children": [
              {
                "value": "中华人民共和国海关关于《中华人民共和国知识产权海关保护条例》的实施办法(2018修正)",
                "label": "中华人民共和国海关关于《中华人民共和国知识产权海关保护条例》的实施办法(2018修正)"
              }
            ]
          },
          {
            "value": "3部门规章",
            "label": "3部门规章",
            "children": [
              {
                "value": "卫生系统保护涉外知识产权暂行规定（试行）",
                "label": "卫生系统保护涉外知识产权暂行规定（试行）"
              },
              {
                "value": "中华人民共和国国家标准公告[2020]24号一一关于批准发布《电子商务平台知识产权保护管理》等8项国家标准的公告",
                "label": "中华人民共和国国家标准公告[2020]24号一一关于批准发布《电子商务平台知识产权保护管理》等8项国家标准的公告"
              }
            ]
          }
        ]
      },
      {
        "value": "争议解决（找国际条约）",
        "label": "争议解决（找国际条约）",
        "children": [
          {
            "value": "4地方法规",
            "label": "4地方法规",
            "children": [
              {
                "value": "地方工作文件",
                "label": "地方工作文件",
                "children": [
                  {
                    "value": "杭州市律师协会国际投资专业委员会关于召开涉外投资争议的仲裁解决法律实务论坛的通知",
                    "label": "杭州市律师协会国际投资专业委员会关于召开涉外投资争议的仲裁解决法律实务论坛的通知"
                  },
                  {
                    "value": "福建省律师协会关于举办国际投资仲裁助力我国海外投资争议解决交流活动的通知",
                    "label": "福建省律师协会关于举办国际投资仲裁助力我国海外投资争议解决交流活动的通知"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "value": "安全法律制度",
        "label": "安全法律制度",
        "children": [
          {
            "value": "行政法规",
            "label": "行政法规",
            "children": [
              {
                "value": "国务院办公厅关于印发自由贸易试验区外商投资国家安全审查试行办法的通知",
                "label": "国务院办公厅关于印发自由贸易试验区外商投资国家安全审查试行办法的通知"
              },
              {
                "value": "国务院办公厅关于建立外国投资者并购境内企业安全审查制度的通知",
                "label": "国务院办公厅关于建立外国投资者并购境内企业安全审查制度的通知"
              }
            ]
          },
          {
            "value": "部门规章",
            "label": "部门规章",
            "children": [
              {
                "value": "外商投资安全审查办法",
                "label": "外商投资安全审查办法"
              },
              {
                "value": "商务部公告2011年第53号—商务部实施外国投资者并购境内企业安全审查制度的规定",
                "label": "商务部公告2011年第53号—商务部实施外国投资者并购境内企业安全审查制度的规定"
              },
              {
                "value": "商务部公告2011年第8号—公布《商务部实施外国投资者并购境内企业安全审查制度有关事项的暂行规定》",
                "label": "商务部公告2011年第8号—公布《商务部实施外国投资者并购境内企业安全审查制度有关事项的暂行规定》"
              }
            ]
          }
        ]
      },
      {
        "value": "反垄断",
        "label": "反垄断",
        "children": [
          {
            "value": "法律",
            "label": "法律",
            "children": [
              {
                "value": "中华人民共和国反垄断法(2022修正)",
                "label": "中华人民共和国反垄断法(2022修正)"
              }
            ]
          },
          {
            "value": "部门规章",
            "label": "部门规章",
            "children": [
              {
                "value": "市场监管总局关于印发《企业境外反垄断合规指引》的通知",
                "label": "市场监管总局关于印发《企业境外反垄断合规指引》的通知"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "value": "俄罗斯",
    "label": "俄罗斯",
    "children": [
      {
        "value": "一、投资法律制度",
        "label": "一、投资法律制度",
        "children": [
          {
            "value": "(一)联邦宪法和宪法性法律",
            "label": "(一)联邦宪法和宪法性法律"
          },
          {
            "value": "(二)联邦规范性法律文件",
            "label": "(二)联邦规范性法律文件",
            "children": [
              {
                "value": "1.《俄罗斯联邦外国投资法》",
                "label": "1.《俄罗斯联邦外国投资法》",
                "children": [
                  {
                    "value": "调节外商投资关系的基础性法律，经联邦委员会批准通过，内容涉及外资的认定标准、外国投资者的法律地位及待遇，外资投资领域，外国投资者的权利、义务，外资法人的注册成立、撤销及法人章程的规定等。",
                    "label": "调节外商投资关系的基础性法律，经联邦委员会批准通过，内容涉及外资的认定标准、外国投资者的法律地位及待遇，外资投资领域，外国投资者的权利、义务，外资法人的注册成立、撤销及法人章程的规定等。"
                  }
                ]
              },
              {
                "value": "2.《俄联邦外资进入对保障国防和国家安全具有战略意义商业组织程序法》",
                "label": "2.《俄联邦外资进入对保障国防和国家安全具有战略意义商业组织程序法》",
                "children": [
                  {
                    "value": "由联邦委员会批准通过，内容涉及宗旨、构成控制战略公司的情形、限制外资进入的45个战略性行业、外国投资者或其关联集团申请事先批准的审查程序、违反法律规定应承担的法律后果等",
                    "label": "由联邦委员会批准通过，内容涉及宗旨、构成控制战略公司的情形、限制外资进入的45个战略性行业、外国投资者或其关联集团申请事先批准的审查程序、违反法律规定应承担的法律后果等"
                  }
                ]
              },
              {
                "value": "3.《俄罗斯联邦经济特区法》",
                "label": "3.《俄罗斯联邦经济特区法》",
                "children": [
                  {
                    "value": "针对经济特区管理而颁布的专项法律，对设立经济特区的目的、经济特区类型、经济特区管理、招商引资的标准和程序、工业生产和技术推广做出明文规定。根据该法案，俄经济特区运营期限由此前的20年延长至49年。",
                    "label": "针对经济特区管理而颁布的专项法律，对设立经济特区的目的、经济特区类型、经济特区管理、招商引资的标准和程序、工业生产和技术推广做出明文规定。根据该法案，俄经济特区运营期限由此前的20年延长至49年。"
                  }
                ]
              },
              {
                "value": "4.《俄罗斯联邦特许协议法》",
                "label": "4.《俄罗斯联邦特许协议法》",
                "children": [
                  {
                    "value": "此法颁布目的在于吸引外资参与俄经济建设，通过特许协议保障有效地利用公共资产和国有资产，提高面向公众的产品、工程和服务的质量水平。在特许协议中，特许权的出让方为俄罗斯联邦政府及其授权机关，或俄罗斯地方政府及其授权机关等，特许权的受让方为外国法人、俄罗斯法人、个体工商者或由两个及多个法人组成的联合体。特许协议的客体为不动产，以各类运输调度类工程设施为主体，其囊括公路运输、管道运输、铁路运输、海运、河运、码头、空运调度、地铁和其他公共交通、电力和热力生产、传输及配送等诸多工程设施在内。根据特许协议的约定，在特许协议客体运营期间，特许权受让方应向出让方支付租金。租金的形式、金额、支付程序和期限可依据特许协议签署决议在特许协议中注明。租金可在运营期末一次付清，也可在运营的单个期限内支付。此外， 《特许协议法》还对特许协议的有效期、支付条款、受让方的权利与义务等内容做出了相应的规定",
                    "label": "此法颁布目的在于吸引外资参与俄经济建设，通过特许协议保障有效地利用公共资产和国有资产，提高面向公众的产品、工程和服务的质量水平。在特许协议中，特许权的出让方为俄罗斯联邦政府及其授权机关，或俄罗斯地方政府及其授权机关等，特许权的受让方为外国法人、俄罗斯法人、个体工商者或由两个及多个法人组成的联合体。特许协议的客体为不动产，以各类运输调度类工程设施为主体，其囊括公路运输、管道运输、铁路运输、海运、河运、码头、空运调度、地铁和其他公共交通、电力和热力生产、传输及配送等诸多工程设施在内。根据特许协议的约定，在特许协议客体运营期间，特许权受让方应向出让方支付租金。租金的形式、金额、支付程序和期限可依据特许协议签署决议在特许协议中注明。租金可在运营期末一次付清，也可在运营的单个期限内支付。此外， 《特许协议法》还对特许协议的有效期、支付条款、受让方的权利与义务等内容做出了相应的规定"
                  }
                ]
              },
              {
                "value": "5.《俄罗斯联邦外汇调节与监督法》",
                "label": "5.《俄罗斯联邦外汇调节与监督法》",
                "children": [
                  {
                    "value": "内容涉及在俄境内或与俄罗斯相关的外汇汇兑转账，开设银行账户，携带外汇进出境，俄外汇管理机关监管及俄本国与外国公民、法人在外汇业务中的权利与义务等。",
                    "label": "内容涉及在俄境内或与俄罗斯相关的外汇汇兑转账，开设银行账户，携带外汇进出境，俄外汇管理机关监管及俄本国与外国公民、法人在外汇业务中的权利与义务等。"
                  }
                ]
              },
              {
                "value": "6.《俄罗斯联邦产品分成协议法》",
                "label": "6.《俄罗斯联邦产品分成协议法》",
                "children": [
                  {
                    "value": "该法主要调整国内外投资者在俄罗斯境内投资矿物资源勘探与开采及其相关活动，极大地简化了投资者与俄联邦国家之间的关系，为外国投资者提供了基本的法律保护，解除了外资进入开发战略资源领域内的禁区，减少了外国投资者的顾虑，该法的出台促进了俄罗斯矿产资源的开发和外资的引进，该法同时规定了投资俄矿产资源产业的外资企业雇用本国劳工比例及设备采购国产化比例。",
                    "label": "该法主要调整国内外投资者在俄罗斯境内投资矿物资源勘探与开采及其相关活动，极大地简化了投资者与俄联邦国家之间的关系，为外国投资者提供了基本的法律保护，解除了外资进入开发战略资源领域内的禁区，减少了外国投资者的顾虑，该法的出台促进了俄罗斯矿产资源的开发和外资的引进，该法同时规定了投资俄矿产资源产业的外资企业雇用本国劳工比例及设备采购国产化比例。"
                  }
                ]
              },
              {
                "value": "7.《俄罗斯联邦矿产资源法》",
                "label": "7.《俄罗斯联邦矿产资源法》",
                "children": [
                  {
                    "value": "该法对矿产的合理开发与保护矿产资源做出规定，明确矿产资源管理部门的职责；对资源权属、矿业权、国家矿产资源储备、联邦级矿区、地方矿区、许可证、矿产有偿使用等方面都做了明确的规定。调整从事地质调查、矿产勘探、开采与加工，及矿山施工建设、矿山封存、科研活动中的权利与义务关系。该法还对外商投资矿产资源做出限制性规定，包括需在俄罗斯境内成立法人实体，获得地质研究、勘探和开采的综合许可证，以及矿区开采权招标或拍卖中的其他限制条件。",
                    "label": "该法对矿产的合理开发与保护矿产资源做出规定，明确矿产资源管理部门的职责；对资源权属、矿业权、国家矿产资源储备、联邦级矿区、地方矿区、许可证、矿产有偿使用等方面都做了明确的规定。调整从事地质调查、矿产勘探、开采与加工，及矿山施工建设、矿山封存、科研活动中的权利与义务关系。该法还对外商投资矿产资源做出限制性规定，包括需在俄罗斯境内成立法人实体，获得地质研究、勘探和开采的综合许可证，以及矿区开采权招标或拍卖中的其他限制条件。"
                  }
                ]
              }
            ]
          },
          {
            "value": "(三)各联邦主体法律",
            "label": "(三)各联邦主体法律"
          },
          {
            "value": "(四)国际条约、国际法原则和准则",
            "label": "(四)国际条约、国际法原则和准则"
          },
          {
            "value": "(五)俄罗斯总统法令",
            "label": "(五)俄罗斯总统法令"
          },
          {
            "value": "(六)政府行政法规",
            "label": "(六)政府行政法规"
          }
        ]
      },
      {
        "value": "二、贸易法律制度",
        "label": "二、贸易法律制度",
        "children": [
          {
            "value": "(一)联邦宪法和宪法性法律",
            "label": "(一)联邦宪法和宪法性法律"
          },
          {
            "value": "(二)联邦规范性法律文件",
            "label": "(二)联邦规范性法律文件",
            "children": [
              {
                "value": "1．《俄罗斯联邦对外贸易活动国家调节法》",
                "label": "1．《俄罗斯联邦对外贸易活动国家调节法》",
                "children": [
                  {
                    "value": "主要规定了俄联邦国家政府机关、各联邦主体政府机构调节对外贸易活动的权力、义务、责任与方式，以及俄罗斯各经济主体及外国人士从事对外经济活动的相关程序。",
                    "label": "主要规定了俄联邦国家政府机关、各联邦主体政府机构调节对外贸易活动的权力、义务、责任与方式，以及俄罗斯各经济主体及外国人士从事对外经济活动的相关程序。"
                  }
                ]
              },
              {
                "value": "2.《关税同盟海关法典》",
                "label": "2.《关税同盟海关法典》",
                "children": [
                  {
                    "value": "俄罗斯、白俄罗斯、哈萨克斯坦三国关税同盟的核心法律文本，由总则与分则构成，主要包括基本规定、海关税费、海关监管、海关作业、海关制度、个别种类货物进出海关边界与对其实施海关作业的特殊要求等",
                    "label": "俄罗斯、白俄罗斯、哈萨克斯坦三国关税同盟的核心法律文本，由总则与分则构成，主要包括基本规定、海关税费、海关监管、海关作业、海关制度、个别种类货物进出海关边界与对其实施海关作业的特殊要求等"
                  }
                ]
              },
              {
                "value": "3.《关于对商品进口实施特别保障、反倾销和反补贴措施法》",
                "label": "3.《关于对商品进口实施特别保障、反倾销和反补贴措施法》",
                "children": [
                  {
                    "value": "主要规定了使用特别保障措施的一般原则；严重损害威胁俄产业的认定因素；特别保障措施的实施；对倾销进口事实的认定；被调查商品出口商的价格承诺；认定外国政府补贴为特殊补贴的原则；补贴进口造成之产业损害的认定；征收临时反补贴、反倾销税和反补贴税的程序等。",
                    "label": "主要规定了使用特别保障措施的一般原则；严重损害威胁俄产业的认定因素；特别保障措施的实施；对倾销进口事实的认定；被调查商品出口商的价格承诺；认定外国政府补贴为特殊补贴的原则；补贴进口造成之产业损害的认定；征收临时反补贴、反倾销税和反补贴税的程序等。"
                  }
                ]
              },
              {
                "value": "4.《关于关税同盟技术调节》第319号决议",
                "label": "4.《关于关税同盟技术调节》第319号决议",
                "children": [
                  {
                    "value": "要求从2013年2月15日起，凡属于关税同盟(cu)辖下产品，都必须申请 cu 认证，同时三国也终止颁发各自原有的认证证书。",
                    "label": "要求从2013年2月15日起，凡属于关税同盟(CU)辖下产品，都必须申请 CU 认证，同时三国也终止颁发各自原有的认证证书。"
                  }
                ]
              }
            ]
          },
          {
            "value": "(三)各联邦主体法律",
            "label": "(三)各联邦主体法律"
          },
          {
            "value": "(四)国际条约、国际法原则和准则",
            "label": "(四)国际条约、国际法原则和准则"
          },
          {
            "value": "(五)俄罗斯总统法令",
            "label": "(五)俄罗斯总统法令"
          },
          {
            "value": "(六)政府行政法规",
            "label": "(六)政府行政法规"
          }
        ]
      },
      {
        "value": "三、公司设立法律制度",
        "label": "三、公司设立法律制度",
        "children": [
          {
            "value": "(一)联邦宪法和宪法性法律",
            "label": "(一)联邦宪法和宪法性法律"
          },
          {
            "value": "(二)联邦规范性法律文件",
            "label": "(二)联邦规范性法律文件",
            "children": [
              {
                "value": "1.《俄罗斯联邦民法典》第一部分",
                "label": "1.《俄罗斯联邦民法典》第一部分",
                "children": [
                  {
                    "value": "确立公司作为商业组织，具有独立法人地位，享有独立法人财产权利的民事主体地位。",
                    "label": "确立公司作为商业组织，具有独立法人地位，享有独立法人财产权利的民事主体地位。"
                  }
                ]
              },
              {
                "value": "2.《俄罗斯联邦有限责任公司法》",
                "label": "2.《俄罗斯联邦有限责任公司法》",
                "children": [
                  {
                    "value": "总则部分规定了有限责任公司的基本原则、公司的责任、股东的权利与义务等。分则部分规定了公司的设立程序与条件，公司章程的内容与国家登记制度，公司的注册资本和公司财产要求，公司的治理结构，公司的改组与清算制度等",
                    "label": "总则部分规定了有限责任公司的基本原则、公司的责任、股东的权利与义务等。分则部分规定了公司的设立程序与条件，公司章程的内容与国家登记制度，公司的注册资本和公司财产要求，公司的治理结构，公司的改组与清算制度等"
                  }
                ]
              },
              {
                "value": "3.《俄罗斯联邦股份公司法》",
                "label": "3.《俄罗斯联邦股份公司法》",
                "children": [
                  {
                    "value": "规定了股份公司的基本原则，公司的成立、重组和清算，公司净资产与法定资本，公司股票、债券和其他有价证券，股息，股东大会、董事会及执行机构，重大交易，关联交易，财务监督，核算和报表，公司文件等",
                    "label": "规定了股份公司的基本原则，公司的成立、重组和清算，公司净资产与法定资本，公司股票、债券和其他有价证券，股息，股东大会、董事会及执行机构，重大交易，关联交易，财务监督，核算和报表，公司文件等"
                  }
                ]
              },
              {
                "value": "4.《俄罗斯联邦法人及个体企业家的国家登记法》",
                "label": "4.《俄罗斯联邦法人及个体企业家的国家登记法》",
                "children": [
                  {
                    "value": "规定了法人登记程序，国家统一登记簿的内容，设立法人的国家登记，以重组方式创建的法人登记程序，创始文件的变更登记，法人的清算或注销登记，拒绝国家登记及违反国家登记程序的责任等。",
                    "label": "规定了法人登记程序，国家统一登记簿的内容，设立法人的国家登记，以重组方式创建的法人登记程序，创始文件的变更登记，法人的清算或注销登记，拒绝国家登记及违反国家登记程序的责任等。"
                  }
                ]
              },
              {
                "value": "5. 《俄罗斯联邦破产法》",
                "label": "5. 《俄罗斯联邦破产法》",
                "children": [
                  {
                    "value": "总则部分规定了破产法的调整范围、破产特征、基本概念、金钱债务的强制性付款的构成和数额、破产案件的审理、向仲裁法院提出请求的权利、债权人会议、债权人与债务人的权利义务、仲裁管理人资质、信息披露等内容。分则部分规定了破产预防制度，仲裁法院对破产案件的审理程序、管辖权、破产案件的中止、仲裁管理人的报酬分摊，案件查证制度，财务恢复制度，外部管理制度，破产清算程序，和解协议制度，特殊类型的法人破产程序，自然人破产的相关规定，简易破产程序的主要内容等。",
                    "label": "总则部分规定了破产法的调整范围、破产特征、基本概念、金钱债务的强制性付款的构成和数额、破产案件的审理、向仲裁法院提出请求的权利、债权人会议、债权人与债务人的权利义务、仲裁管理人资质、信息披露等内容。分则部分规定了破产预防制度，仲裁法院对破产案件的审理程序、管辖权、破产案件的中止、仲裁管理人的报酬分摊，案件查证制度，财务恢复制度，外部管理制度，破产清算程序，和解协议制度，特殊类型的法人破产程序，自然人破产的相关规定，简易破产程序的主要内容等。"
                  }
                ]
              }
            ]
          },
          {
            "value": "(三)各联邦主体法律",
            "label": "(三)各联邦主体法律"
          },
          {
            "value": "(四)国际条约、国际法原则和准则",
            "label": "(四)国际条约、国际法原则和准则"
          },
          {
            "value": "(五)俄罗斯总统法令",
            "label": "(五)俄罗斯总统法令"
          },
          {
            "value": "(六)政府行政法规",
            "label": "(六)政府行政法规"
          }
        ]
      },
      {
        "value": "四、工程承包法律制度",
        "label": "四、工程承包法律制度",
        "children": [
          {
            "value": "(一)联邦宪法和宪法性法律",
            "label": "(一)联邦宪法和宪法性法律"
          },
          {
            "value": "(二)联邦规范性法律文件",
            "label": "(二)联邦规范性法律文件",
            "children": [
              {
                "value": "1.《俄罗斯联邦城市建设法典》",
                "label": "1.《俄罗斯联邦城市建设法典》",
                "children": [
                  {
                    "value": "总则部分规定了本法典中使用的基本概念，城市建设立法的基本原则，建筑项目形成的法律基础，城市建设法调整的关系，城市建设关系的主体；分则部分规定了建筑领域内联邦、联邦主体以及自治地方的权限，地区规划的相关规定，建筑分区制度，地区规划制度，建筑结构设计、建设、重建制度，保障建筑活动的信息的相关规定，违反该法的责任，关于俄联邦直辖市莫斯科、圣彼得堡和塞瓦斯托波尔市的城市建设的特别规定等。",
                    "label": "总则部分规定了本法典中使用的基本概念，城市建设立法的基本原则，建筑项目形成的法律基础，城市建设法调整的关系，城市建设关系的主体；分则部分规定了建筑领域内联邦、联邦主体以及自治地方的权限，地区规划的相关规定，建筑分区制度，地区规划制度，建筑结构设计、建设、重建制度，保障建筑活动的信息的相关规定，违反该法的责任，关于俄联邦直辖市莫斯科、圣彼得堡和塞瓦斯托波尔市的城市建设的特别规定等。"
                  }
                ]
              },
              {
                "value": "2.《俄罗斯联邦民法典》第37章“承包”",
                "label": "2.《俄罗斯联邦民法典》第37章“承包”",
                "children": [
                  {
                    "value": "对建筑承包合同内容、发包方和承包方的责任与义务、建筑工程质量等都做了详细规定，概括为以下几个方面：建筑承包的一般规定；双方当事人间风险的分担；工程价格及其工程款支付方式；工程项目保险；技术文件和预算;发包方的补充合同义务；承包方的留置权；承包方保护环境和确保施工安全的义务；暂停工程的后果；质量的担保；发包人负担消除瑕疵的费用；工程的交付和验收等。",
                    "label": "对建筑承包合同内容、发包方和承包方的责任与义务、建筑工程质量等都做了详细规定，概括为以下几个方面：建筑承包的一般规定；双方当事人间风险的分担；工程价格及其工程款支付方式；工程项目保险；技术文件和预算;发包方的补充合同义务；承包方的留置权；承包方保护环境和确保施工安全的义务；暂停工程的后果；质量的担保；发包人负担消除瑕疵的费用；工程的交付和验收等。"
                  }
                ]
              },
              {
                "value": "3. 《俄罗斯联邦建筑活动法》",
                "label": "3. 《俄罗斯联邦建筑活动法》",
                "children": [
                  {
                    "value": "该法调整在专业建筑活动过程中出现的关系，且以发展建筑艺术，促进历史文物建筑以及自然景观的保护为主旨。规定了从事建筑项目的建筑活动的公民和法人、国家机关、地方自治机关、甲方 (开发商)、承包商以及所有者 (业主)的权利、义务和责任。",
                    "label": "该法调整在专业建筑活动过程中出现的关系，且以发展建筑艺术，促进历史文物建筑以及自然景观的保护为主旨。规定了从事建筑项目的建筑活动的公民和法人、国家机关、地方自治机关、甲方 (开发商)、承包商以及所有者 (业主)的权利、义务和责任。"
                  }
                ]
              }
            ]
          },
          {
            "value": "(三)各联邦主体法律",
            "label": "(三)各联邦主体法律"
          },
          {
            "value": "(四)国际条约、国际法原则和准则",
            "label": "(四)国际条约、国际法原则和准则"
          },
          {
            "value": "(五)俄罗斯总统法令",
            "label": "(五)俄罗斯总统法令"
          },
          {
            "value": "(六)政府行政法规",
            "label": "(六)政府行政法规"
          }
        ]
      },
      {
        "value": "五、土地法律制度",
        "label": "五、土地法律制度",
        "children": [
          {
            "value": "(一)联邦宪法和宪法性法律",
            "label": "(一)联邦宪法和宪法性法律"
          },
          {
            "value": "(二)联邦规范性法律文件",
            "label": "(二)联邦规范性法律文件",
            "children": [
              {
                "value": "1.《俄罗斯联邦土地法典》",
                "label": "1.《俄罗斯联邦土地法典》",
                "children": [
                  {
                    "value": "总则部分包括土地立法的基本原则，土地关系的主体、客体，土地的构成，联邦主体在土地领域的职权，土地保护制度，土地所有权制度，土地权利的取得、限制和终止，土地纠纷处理，国家征收地块时的损失赔偿，土地监测、整治和国家保护，违反土地保护和利用的法律责任。分则部分包括各类农用地的使用特点，居民点土地的范围划定、构成和使用，国家特殊建设用地法律制度，受特殊保护的区域制度，林地、水源地和储备土地法律制度。",
                    "label": "总则部分包括土地立法的基本原则，土地关系的主体、客体，土地的构成，联邦主体在土地领域的职权，土地保护制度，土地所有权制度，土地权利的取得、限制和终止，土地纠纷处理，国家征收地块时的损失赔偿，土地监测、整治和国家保护，违反土地保护和利用的法律责任。分则部分包括各类农用地的使用特点，居民点土地的范围划定、构成和使用，国家特殊建设用地法律制度，受特殊保护的区域制度，林地、水源地和储备土地法律制度。"
                  }
                ]
              },
              {
                "value": "2.《俄罗斯农用土地流转法》",
                "label": "2.《俄罗斯农用土地流转法》",
                "children": [
                  {
                    "value": "该法明确了包括农地在内的土地私有化原则及土地买卖的程序。其总则部分规定了适用的主体、客体，农地的流通办法，共有农地中的份地流通的特殊规定，打破农地用途的变更限制和流转的数量限制，明确了农民所获土地份额的自由买卖，并对土地份额如何从共有产权中划分出来做了十分详细和明确的规定。",
                    "label": "该法明确了包括农地在内的土地私有化原则及土地买卖的程序。其总则部分规定了适用的主体、客体，农地的流通办法，共有农地中的份地流通的特殊规定，打破农地用途的变更限制和流转的数量限制，明确了农民所获土地份额的自由买卖，并对土地份额如何从共有产权中划分出来做了十分详细和明确的规定。"
                  }
                ]
              }
            ]
          },
          {
            "value": "(三)各联邦主体法律",
            "label": "(三)各联邦主体法律"
          },
          {
            "value": "(四)国际条约、国际法原则和准则",
            "label": "(四)国际条约、国际法原则和准则"
          },
          {
            "value": "(五)俄罗斯总统法令",
            "label": "(五)俄罗斯总统法令"
          },
          {
            "value": "(六)政府行政法规",
            "label": "(六)政府行政法规"
          }
        ]
      },
      {
        "value": "六、税收法律制度",
        "label": "六、税收法律制度",
        "children": [
          {
            "value": "(一)  联邦宪法和宪法性法律",
            "label": "(一)  联邦宪法和宪法性法律",
            "children": [
              {
                "value": "《俄罗斯联邦宪法》",
                "label": "《俄罗斯联邦宪法》",
                "children": [
                  {
                    "value": "劳动自由，禁止强制劳动，每个人有权无歧视地获得劳动报酬，劳动报酬不得低于联邦法律规定的最低工资标准，劳动者有权获得失业保护，外国公民及无国籍人在俄罗斯联邦与俄罗斯公民享有同等权利、履行同等义务等。",
                    "label": "劳动自由，禁止强制劳动，每个人有权无歧视地获得劳动报酬，劳动报酬不得低于联邦法律规定的最低工资标准，劳动者有权获得失业保护，外国公民及无国籍人在俄罗斯联邦与俄罗斯公民享有同等权利、履行同等义务等。"
                  }
                ]
              }
            ]
          },
          {
            "value": "(二)  联邦规范性法律文件",
            "label": "(二)  联邦规范性法律文件",
            "children": [
              {
                "value": "1.《俄罗斯联邦劳动法典》",
                "label": "1.《俄罗斯联邦劳动法典》",
                "children": [
                  {
                    "value": "其中的一般规定包括了劳动法典的基本原则、劳动关系、劳动关系双方的基本权利和义务等，另外还有劳动领域的社会合作、劳动合同、工作时间、休息时间、工资和劳动定额、保障和补偿、劳动规章和劳动纪律、员工的职业培训、再培训和技能提高、劳动保护、劳动合同双方的责任、个别工种员工劳动的特别规定、劳动权利和自由的保护、劳动争议的审理和解决、违反劳动法和包含劳动法规范的其他文件的责任等。",
                    "label": "其中的一般规定包括了劳动法典的基本原则、劳动关系、劳动关系双方的基本权利和义务等，另外还有劳动领域的社会合作、劳动合同、工作时间、休息时间、工资和劳动定额、保障和补偿、劳动规章和劳动纪律、员工的职业培训、再培训和技能提高、劳动保护、劳动合同双方的责任、个别工种员工劳动的特别规定、劳动权利和自由的保护、劳动争议的审理和解决、违反劳动法和包含劳动法规范的其他文件的责任等。"
                  }
                ]
              },
              {
                "value": "2.《俄罗斯联邦居民就业法》",
                "label": "2.《俄罗斯联邦居民就业法》"
              },
              {
                "value": "3.《最低工资法》",
                "label": "3.《最低工资法》"
              },
              {
                "value": "4.《俄罗斯联邦残疾人社会保障法》",
                "label": "4.《俄罗斯联邦残疾人社会保障法》"
              },
              {
                "value": "5.《俄罗斯联邦劳动退休金法》",
                "label": "5.《俄罗斯联邦劳动退休金法》"
              },
              {
                "value": "6.《工会及其权利和活动保障法》",
                "label": "6.《工会及其权利和活动保障法》"
              },
              {
                "value": "7.《俄罗斯联邦行政处罚法典》",
                "label": "7.《俄罗斯联邦行政处罚法典》"
              }
            ]
          },
          {
            "value": "(三)各联邦主体法律",
            "label": "(三)各联邦主体法律"
          },
          {
            "value": "(四)国际条约、国际法原则和准则",
            "label": "(四)国际条约、国际法原则和准则",
            "children": [
              {
                "value": "《俄罗斯联邦外国人法律地位法》",
                "label": "《俄罗斯联邦外国人法律地位法》",
                "children": [
                  {
                    "value": "主要规定了外国公民法律地位的原则、外国公民在俄联邦的临时居留与长期居留、身份证件、外国公民的劳动活动、来俄邀请函的办理程序、外国公民的移民登记和联邦国家的移民监督、法律责任等。",
                    "label": "主要规定了外国公民法律地位的原则、外国公民在俄联邦的临时居留与长期居留、身份证件、外国公民的劳动活动、来俄邀请函的办理程序、外国公民的移民登记和联邦国家的移民监督、法律责任等。"
                  }
                ]
              },
              {
                "value": "《俄罗斯出入境秩序法》",
                "label": "《俄罗斯出入境秩序法》"
              }
            ]
          },
          {
            "value": "(五)俄罗斯总统法令",
            "label": "(五)俄罗斯总统法令"
          },
          {
            "value": "(六)政府行政法规",
            "label": "(六)政府行政法规"
          }
        ]
      },
      {
        "value": "八、环境保护制度",
        "label": "八、环境保护制度",
        "children": [
          {
            "value": "(一)联邦宪法和宪法性法律",
            "label": "(一)联邦宪法和宪法性法律"
          },
          {
            "value": "(二)联邦规范性法律文件",
            "label": "(二)联邦规范性法律文件",
            "children": [
              {
                "value": "《俄罗斯联邦环境保护法》",
                "label": "《俄罗斯联邦环境保护法》",
                "children": [
                  {
                    "value": "第一部分包括环境法相关的基本原则、基本概念以及法律保护的对象、国家和地方在环境保护领域的权利范围及职权划分、各个环境保护法主体的权利及义务，并且对经济活动领域的环境保护作出了明确规定。第二部分规定了环境保护的标准、生态鉴定和环境影响评价制度、环境保护的具体要求、国家环境监测、保护的特殊客体、生态灾难地区和环境保护监督。第三部分规定了建设生态文明的基础、环境保护科学研究、生态方面的教育、环境保护纠纷的处理、违反环境保护法的责任、国际领域的合作、该法的生效日期和法律冲突时的有关适用问题。",
                    "label": "第一部分包括环境法相关的基本原则、基本概念以及法律保护的对象、国家和地方在环境保护领域的权利范围及职权划分、各个环境保护法主体的权利及义务，并且对经济活动领域的环境保护作出了明确规定。第二部分规定了环境保护的标准、生态鉴定和环境影响评价制度、环境保护的具体要求、国家环境监测、保护的特殊客体、生态灾难地区和环境保护监督。第三部分规定了建设生态文明的基础、环境保护科学研究、生态方面的教育、环境保护纠纷的处理、违反环境保护法的责任、国际领域的合作、该法的生效日期和法律冲突时的有关适用问题。"
                  }
                ]
              }
            ]
          },
          {
            "value": "(三)各联邦主体法律",
            "label": "(三)各联邦主体法律",
            "children": [
              {
                "value": "《生态鉴定法》（杜马丁）",
                "label": "《生态鉴定法》（杜马丁）",
                "children": [
                  {
                    "value": "包括俄罗斯联邦总统、国家权力机关和地方自治机关的职权，国家生态鉴定的程序及要求，社会生态鉴定的程序及要求，进行生态鉴定的委托方的权利和义务，法律责任及争议解决等内容。",
                    "label": "包括俄罗斯联邦总统、国家权力机关和地方自治机关的职权，国家生态鉴定的程序及要求，社会生态鉴定的程序及要求，进行生态鉴定的委托方的权利和义务，法律责任及争议解决等内容。"
                  }
                ]
              }
            ]
          },
          {
            "value": "(四)国际条约、国际法原则和准则",
            "label": "(四)国际条约、国际法原则和准则"
          },
          {
            "value": "(五)俄罗斯总统法令",
            "label": "(五)俄罗斯总统法令"
          },
          {
            "value": "(六)政府行政法规",
            "label": "(六)政府行政法规"
          }
        ]
      },
      {
        "value": "九、知识产权法律制度",
        "label": "九、知识产权法律制度",
        "children": [
          {
            "value": "(一)联邦宪法和宪法性法律",
            "label": "(一)联邦宪法和宪法性法律"
          },
          {
            "value": "(二)联邦规范性法律文件",
            "label": "(二)联邦规范性法律文件",
            "children": [
              {
                "value": "《俄罗斯联邦民法典》",
                "label": "《俄罗斯联邦民法典》",
                "children": [
                  {
                    "value": "对著作权及邻接权、专利、育种成果权、集成电路拓扑图、商业秘密、个别化方法和统一技术等知识产权客体作出了规定。",
                    "label": "对著作权及邻接权、专利、育种成果权、集成电路拓扑图、商业秘密、个别化方法和统一技术等知识产权客体作出了规定。"
                  }
                ]
              }
            ]
          },
          {
            "value": "(三)各联邦主体法律",
            "label": "(三)各联邦主体法律"
          },
          {
            "value": "(四)国际条约、国际法原则和准则",
            "label": "(四)国际条约、国际法原则和准则",
            "children": [
              {
                "value": "1.《保护工业产权巴黎公约》",
                "label": "1.《保护工业产权巴黎公约》"
              },
              {
                "value": "2.《专利合作条约》",
                "label": "2.《专利合作条约》"
              },
              {
                "value": "3.《商标国际注册马德里协定》",
                "label": "3.《商标国际注册马德里协定》"
              },
              {
                "value": "4.《商标注册用商品与服务国际分类尼斯协定》",
                "label": "4.《商标注册用商品与服务国际分类尼斯协定》"
              },
              {
                "value": "5.《欧洲专利合作条约》",
                "label": "5.《欧洲专利合作条约》"
              },
              {
                "value": "6.《保护文学和艺术作品伯尔尼公约》",
                "label": "6.《保护文学和艺术作品伯尔尼公约》"
              },
              {
                "value": "7.《世界版权公约》",
                "label": "7.《世界版权公约》"
              },
              {
                "value": "8.《建立世界知识产权组织公约》",
                "label": "8.《建立世界知识产权组织公约》"
              }
            ]
          },
          {
            "value": "(五)俄罗斯总统法令",
            "label": "(五)俄罗斯总统法令"
          },
          {
            "value": "(六)政府行政法规",
            "label": "(六)政府行政法规"
          }
        ]
      },
      {
        "value": "十、争议解决法律制度",
        "label": "十、争议解决法律制度",
        "children": [
          {
            "value": "(一)联邦宪法和宪法性法律",
            "label": "(一)联邦宪法和宪法性法律"
          },
          {
            "value": "(二)联邦规范性法律文件",
            "label": "(二)联邦规范性法律文件",
            "children": [
              {
                "value": "1.《俄罗斯联邦民事诉讼法典》",
                "label": "1.《俄罗斯联邦民事诉讼法典》",
                "children": [
                  {
                    "value": "规定了民事诉讼的基本原则、审判组织和回避、案件参加人、诉讼代理、证据、诉讼费用、诉讼期间、法院的通知和传唤、第一审法院诉讼程序、第二审法院诉讼程序、对已经发生法律效力的判决、裁定和决定的重新审理、涉外案件的诉讼程序、仲裁机构裁决案件的执行和监督程序。",
                    "label": "规定了民事诉讼的基本原则、审判组织和回避、案件参加人、诉讼代理、证据、诉讼费用、诉讼期间、法院的通知和传唤、第一审法院诉讼程序、第二审法院诉讼程序、对已经发生法律效力的判决、裁定和决定的重新审理、涉外案件的诉讼程序、仲裁机构裁决案件的执行和监督程序。"
                  }
                ]
              },
              {
                "value": "2.《俄罗斯联邦仲裁程序法典》",
                "label": "2.《俄罗斯联邦仲裁程序法典》",
                "children": [
                  {
                    "value": "涉及内容有基本原则、仲裁法庭的构成、回避制度、仲裁法院的管辖权、诉讼参加人、证据与证明、保全措施、 诉讼费用、诉讼期间、第一审仲裁法院的诉讼程序、行政法律关系和其他公共法律关系案件在第一审仲裁法院的诉讼程序、仲裁法院审理的几类特定案件、涉外案件的诉讼程序、对仲裁法院裁判的再审、执行程序。",
                    "label": "涉及内容有基本原则、仲裁法庭的构成、回避制度、仲裁法院的管辖权、诉讼参加人、证据与证明、保全措施、 诉讼费用、诉讼期间、第一审仲裁法院的诉讼程序、行政法律关系和其他公共法律关系案件在第一审仲裁法院的诉讼程序、仲裁法院审理的几类特定案件、涉外案件的诉讼程序、对仲裁法院裁判的再审、执行程序。"
                  }
                ]
              },
              {
                "value": "3.《俄罗斯联邦仲裁机构法》",
                "label": "3.《俄罗斯联邦仲裁机构法》",
                "children": [
                  {
                    "value": "规定了仲裁机构、仲裁协议、仲裁庭的组成、仲裁裁决的法律依据、仲裁程序、仲裁程序的终止、裁决的执行与撤销、常设仲裁机构的设立、设立常设仲裁机构的非商业性组织的责任等。",
                    "label": "规定了仲裁机构、仲裁协议、仲裁庭的组成、仲裁裁决的法律依据、仲裁程序、仲裁程序的终止、裁决的执行与撤销、常设仲裁机构的设立、设立常设仲裁机构的非商业性组织的责任等。"
                  }
                ]
              },
              {
                "value": "4.《俄罗斯国际商事仲裁法》",
                "label": "4.《俄罗斯国际商事仲裁法》",
                "children": [
                  {
                    "value": "规定了仲裁协议、仲裁庭的组成、仲裁庭的管辖权、仲裁程序的进行、裁决的作出和程序的终止、对裁决的异议、仲裁裁决的承认与执行等。",
                    "label": "规定了仲裁协议、仲裁庭的组成、仲裁庭的管辖权、仲裁程序的进行、裁决的作出和程序的终止、对裁决的异议、仲裁裁决的承认与执行等。"
                  }
                ]
              }
            ]
          },
          {
            "value": "(三)各联邦主体法律",
            "label": "(三)各联邦主体法律"
          },
          {
            "value": "(四)国际条约、国际法原则和准则",
            "label": "(四)国际条约、国际法原则和准则",
            "children": [
              {
                "value": "1.《中俄关于促进和相互保护投资协定》",
                "label": "1.《中俄关于促进和相互保护投资协定》",
                "children": [
                  {
                    "value": "规定缔约一方投资者在对方境内投资产生的任何争议，双方应通过友好协商解决。但自争议发生之日起６个月内，双方没有就争议达成一致的，可采取三种方式解决。",
                    "label": "规定缔约一方投资者在对方境内投资产生的任何争议，双方应通过友好协商解决。但自争议发生之日起６个月内，双方没有就争议达成一致的，可采取三种方式解决。"
                  }
                ]
              },
              {
                "value": "2.《华盛顿公约》",
                "label": "2.《华盛顿公约》",
                "children": [
                  {
                    "value": "该公约的主要宗旨是为参加该公约的各缔约国国民之间的投资争端，提供仲裁和调停的便利，以排除外交干涉和政治干预。",
                    "label": "该公约的主要宗旨是为参加该公约的各缔约国国民之间的投资争端，提供仲裁和调停的便利，以排除外交干涉和政治干预。"
                  }
                ]
              },
              {
                "value": "3.《关于争端解决规则与程序的谅解》",
                "label": "3.《关于争端解决规则与程序的谅解》",
                "children": [
                  {
                    "value": "协议的范围和适用，总则，管理，斡旋、磋商，调解，专家组(包括专家组的设立、职权范围、组成、程序、职能)，涉及多个起诉方的程序，机密性，寻求信息的权利，中期审议阶段，专家组报告的通过，争端解决机构决定的时限，上诉机构，对执行建议和裁决的监督，多边体制的加强，补偿和中止减让，涉及最不发达国家成员的特殊程序，仲裁等。",
                    "label": "协议的范围和适用，总则，管理，斡旋、磋商，调解，专家组(包括专家组的设立、职权范围、组成、程序、职能)，涉及多个起诉方的程序，机密性，寻求信息的权利，中期审议阶段，专家组报告的通过，争端解决机构决定的时限，上诉机构，对执行建议和裁决的监督，多边体制的加强，补偿和中止减让，涉及最不发达国家成员的特殊程序，仲裁等。"
                  }
                ]
              },
              {
                "value": "4.《承认和执行外国仲裁裁决公约》",
                "label": "4.《承认和执行外国仲裁裁决公约》",
                "children": [
                  {
                    "value": "规定除非有该公约明确列举的不予执行裁决的理由，各缔约国的主管机关和执行机关都有义务承认和执行外国仲裁裁决。",
                    "label": "规定除非有该公约明确列举的不予执行裁决的理由，各缔约国的主管机关和执行机关都有义务承认和执行外国仲裁裁决。"
                  }
                ]
              },
              {
                "value": "5.《中华人民共和国和俄罗斯联邦关于民事和刑事司法协助的条约》",
                "label": "5.《中华人民共和国和俄罗斯联邦关于民事和刑事司法协助的条约》",
                "children": [
                  {
                    "value": "宗旨是在尊重主权和互惠的基础上，实现中俄两国在司法领域的合作，互相提供民事和刑事方面的司法协助。",
                    "label": "宗旨是在尊重主权和互惠的基础上，实现中俄两国在司法领域的合作，互相提供民事和刑事方面的司法协助。"
                  }
                ]
              }
            ]
          },
          {
            "value": "(五)俄罗斯总统法令",
            "label": "(五)俄罗斯总统法令"
          },
          {
            "value": "(六)政府行政法规",
            "label": "(六)政府行政法规"
          }
        ]
      }
    ]
  },
  {
    "value": "欧洲",
    "label": "欧洲",
    "children": [
      {
        "value": "贸易法律制度",
        "label": "贸易法律制度",
        "children": [
          {
            "value": "进口管理法规",
            "label": "进口管理法规",
            "children": [
              {
                "value": "《关于对进口实施共同规则的（ec）3285/94号法规》",
                "label": "《关于对进口实施共同规则的（EC）3285/94号法规》"
              },
              {
                "value": "《关于对某些第三国实施共同进口规则的（ec）519/94号法规》",
                "label": "《关于对某些第三国实施共同进口规则的（EC）519/94号法规》"
              },
              {
                "value": "《关于对某些纺织品进口实施共同规则的（ec）3030/93号法规》",
                "label": "《关于对某些纺织品进口实施共同规则的（EC）3030/93号法规》"
              },
              {
                "value": "《关于实施乌拉圭回合农业协议所需采取措施的（ec）974/95号法规》",
                "label": "《关于实施乌拉圭回合农业协议所需采取措施的（EC）974/95号法规》"
              },
              {
                "value": "《关于农产品共同关税术语调整程序的（eec）234/79号法规》",
                "label": "《关于农产品共同关税术语调整程序的（EEC）234/79号法规》"
              },
              {
                "value": "《关于某些农产品加工产品的贸易安排的（ec）3448/93号法规》",
                "label": "《关于某些农产品加工产品的贸易安排的（EC）3448/93号法规》"
              }
            ]
          },
          {
            "value": "出口管理法规",
            "label": "出口管理法规",
            "children": [
              {
                "value": "法规",
                "label": "法规",
                "children": [
                  {
                    "value": "《关于实施共同出口规则的（eec）2603/69号法规》",
                    "label": "《关于实施共同出口规则的（EEC）2603/69号法规》"
                  },
                  {
                    "value": "《关于文化产品出口的（eec）3911/92号法规》",
                    "label": "《关于文化产品出口的（EEC）3911/92号法规》"
                  },
                  {
                    "value": "《关于危险化学品进出口的（eec）2455/92号法规》",
                    "label": "《关于危险化学品进出口的（EEC）2455/92号法规》"
                  },
                  {
                    "value": "《关于设定农产品出口退税术语的（ec）3846/87号法规》",
                    "label": "《关于设定农产品出口退税术语的（EC）3846/87号法规》"
                  },
                  {
                    "value": "《关于建立两用产品及技术出口控制体系的（ec）1183/2007号法规》",
                    "label": "《关于建立两用产品及技术出口控制体系的（EC）1183/2007号法规》"
                  }
                ]
              },
              {
                "value": "决定",
                "label": "决定",
                "children": [
                  {
                    "value": "《关于出口信贷保险、信贷担保和融资信贷的咨询与信息程序的（eec）2455/92号决定》",
                    "label": "《关于出口信贷保险、信贷担保和融资信贷的咨询与信息程序的（EEC）2455/92号决定》"
                  },
                  {
                    "value": "《关于在官方支持的出口信贷领域适用项目融资框架协议原则的（ec）77/2001号决定》",
                    "label": "《关于在官方支持的出口信贷领域适用项目融资框架协议原则的（EC）77/2001号决定》"
                  }
                ]
              }
            ]
          },
          {
            "value": "贸易救济措施",
            "label": "贸易救济措施",
            "children": [
              {
                "value": "反倾销",
                "label": "反倾销",
                "children": [
                  {
                    "value": "条例",
                    "label": "条例",
                    "children": [
                      {
                        "value": "欧盟理事会第459/68号条例",
                        "label": "欧盟理事会第459/68号条例"
                      },
                      {
                        "value": "欧盟理事会第3283/94号条例",
                        "label": "欧盟理事会第3283/94号条例"
                      },
                      {
                        "value": "欧盟理事会第3284/94号条例",
                        "label": "欧盟理事会第3284/94号条例"
                      },
                      {
                        "value": "欧盟理事会第459/68号条例",
                        "label": "欧盟理事会第459/68号条例"
                      },
                      {
                        "value": "欧盟理事会第1225/2009号条例",
                        "label": "欧盟理事会第1225/2009号条例"
                      },
                      {
                        "value": "欧盟理事会第765/2012号条例",
                        "label": "欧盟理事会第765/2012号条例"
                      }
                    ]
                  }
                ]
              },
              {
                "value": "反补贴",
                "label": "反补贴",
                "children": [
                  {
                    "value": "条例",
                    "label": "条例",
                    "children": [
                      {
                        "value": "欧盟理事会第597/2009号条例",
                        "label": "欧盟理事会第597/2009号条例"
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "value": "食品安全及动植物卫生管理",
            "label": "食品安全及动植物卫生管理",
            "children": [
              {
                "value": "法规",
                "label": "法规",
                "children": [
                  {
                    "value": "《食品基本法》",
                    "label": "《食品基本法》"
                  }
                ]
              },
              {
                "value": "条例",
                "label": "条例",
                "children": [
                  {
                    "value": "欧盟理事会有关食品卫生的第852/2004号条例",
                    "label": "欧盟理事会有关食品卫生的第852/2004号条例"
                  },
                  {
                    "value": "有关动物源性食品特殊卫生规则的第853/2004号条例",
                    "label": "有关动物源性食品特殊卫生规则的第853/2004号条例"
                  },
                  {
                    "value": "有关人类消费用动物源性食品官方控制组织的特殊规则的第854/2004号条例",
                    "label": "有关人类消费用动物源性食品官方控制组织的特殊规则的第854/2004号条例"
                  }
                ]
              }
            ]
          },
          {
            "value": "共同海关税则",
            "label": "共同海关税则",
            "children": [
              {
                "value": "法规",
                "label": "法规",
                "children": [
                  {
                    "value": "《关于建立欧盟海关法典的第（eec）2913/92号法规》",
                    "label": "《关于建立欧盟海关法典的第（EEC）2913/92号法规》"
                  }
                ]
              },
              {
                "value": "条例",
                "label": "条例",
                "children": [
                  {
                    "value": "欧盟理事会第2658/87号条例",
                    "label": "欧盟理事会第2658/87号条例"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "value": "争议解决法律制度--投资法庭制度",
        "label": "争议解决法律制度--投资法庭制度",
        "children": [
          {
            "value": "条约",
            "label": "条约",
            "children": [
              {
                "value": "里斯本条约",
                "label": "里斯本条约"
              }
            ]
          },
          {
            "value": "协定",
            "label": "协定",
            "children": [
              {
                "value": "欧盟与各国签订的投资贸易协定",
                "label": "欧盟与各国签订的投资贸易协定"
              }
            ]
          }
        ]
      },
      {
        "value": "反垄断法律制度",
        "label": "反垄断法律制度",
        "children": [
          {
            "value": "反垄断法律法规",
            "label": "反垄断法律法规",
            "children": [
              {
                "value": "条例",
                "label": "条例",
                "children": [
                  {
                    "value": "《欧洲经济共同体条约》81/82条",
                    "label": "《欧洲经济共同体条约》81/82条"
                  },
                  {
                    "value": "《第十七号理事会条例》",
                    "label": "《第十七号理事会条例》"
                  },
                  {
                    "value": "《第1/2003号理事会条例》（2002）",
                    "label": "《第1/2003号理事会条例》（2002）"
                  },
                  {
                    "value": "《第4064/89号合并控制条例》",
                    "label": "《第4064/89号合并控制条例》"
                  },
                  {
                    "value": "《合并控制条例》（2004）",
                    "label": "《合并控制条例》（2004）"
                  },
                  {
                    "value": "《欧盟运行条约》101/102条（2019）",
                    "label": "《欧盟运行条约》101/102条（2019）"
                  }
                ]
              }
            ]
          },
          {
            "value": "数字市场反垄断规制",
            "label": "数字市场反垄断规制",
            "children": [
              {
                "value": "法规",
                "label": "法规",
                "children": [
                  {
                    "value": "《数字市场法》（2020）",
                    "label": "《数字市场法》（2020）"
                  },
                  {
                    "value": "《数字服务法》（2020）",
                    "label": "《数字服务法》（2020）"
                  }
                ]
              },
              {
                "value": "条例",
                "label": "条例",
                "children": [
                  {
                    "value": "《一般数据保护条例》（2018）",
                    "label": "《一般数据保护条例》（2018）"
                  }
                ]
              },
              {
                "value": "指南建议",
                "label": "指南建议",
                "children": [
                  {
                    "value": "《关于处理车联网有关应用中的个人数据的第01/2020号指南》",
                    "label": "《关于处理车联网有关应用中的个人数据的第01/2020号指南》"
                  },
                  {
                    "value": "《关于2016/679号条例第46 (2) (a) 条和第46 (3) (b) 条在欧盟和非欧盟公共机构之间个人数据传输的第02/2020号指南》",
                    "label": "《关于2016/679号条例第46 (2) (a) 条和第46 (3) (b) 条在欧盟和非欧盟公共机构之间个人数据传输的第02/2020号指南》"
                  },
                  {
                    "value": "《关于新冠疫情背景下的科学研究目的处理健康数据的第03/2020号指南》",
                    "label": "《关于新冠疫情背景下的科学研究目的处理健康数据的第03/2020号指南》"
                  },
                  {
                    "value": "《关于在新冠疫情中使用位置数据和接触者追踪工具的第04/2020号指南》",
                    "label": "《关于在新冠疫情中使用位置数据和接触者追踪工具的第04/2020号指南》"
                  },
                  {
                    "value": "《关于2016/679号条例项下同意条款的第05/2020号指南》",
                    "label": "《关于2016/679号条例项下同意条款的第05/2020号指南》"
                  },
                  {
                    "value": "《关于〈支付服务指令ⅱ〉和gdpr的协调适用关系的第06/2020号指南》",
                    "label": "《关于〈支付服务指令Ⅱ〉和GDPR的协调适用关系的第06/2020号指南》"
                  },
                  {
                    "value": "《关于gdpr 中数据控制者和数据处理者概念的第07/2020号指南》",
                    "label": "《关于GDPR 中数据控制者和数据处理者概念的第07/2020号指南》"
                  },
                  {
                    "value": "《关于社交媒体用户提供定向服务的第08/2020号准则》",
                    "label": "《关于社交媒体用户提供定向服务的第08/2020号准则》"
                  },
                  {
                    "value": "《关于2016/679号条例项下的相关和合理异议的第09/2020号指南》",
                    "label": "《关于2016/679号条例项下的相关和合理异议的第09/2020号指南》"
                  },
                  {
                    "value": "《关于gdpr第23条项下的限制主体权利的第10/2020号指南》",
                    "label": "《关于GDPR第23条项下的限制主体权利的第10/2020号指南》"
                  },
                  {
                    "value": "《关于采取传输t具补充措施以确保符合欧盟个人数据保护水平的第01/2020号建议》",
                    "label": "《关于采取传输T具补充措施以确保符合欧盟个人数据保护水平的第01/2020号建议》"
                  },
                  {
                    "value": "《针对监控措施的关丁欧盟重要保障的第002/2020号建议》",
                    "label": "《针对监控措施的关丁欧盟重要保障的第002/2020号建议》"
                  },
                  {
                    "value": "《关于通过视频设备处理个人数据的第03/2019号指南》",
                    "label": "《关于通过视频设备处理个人数据的第03/2019号指南》"
                  },
                  {
                    "value": "《关于gipk 下搜索引擎案件中被遗忘权认定标准的第05/2019号指南(第1部分) 》",
                    "label": "《关于GIPK 下搜索引擎案件中被遗忘权认定标准的第05/2019号指南(第1部分) 》"
                  },
                  {
                    "value": "《关于 (hdpr第25条的设计和默认隐私保护2.0的第04/2019号指南》《关于处理车联网有关应用中的个人数据的第01/2020号指南》",
                    "label": "《关于 (HDPR第25条的设计和默认隐私保护2.0的第04/2019号指南》《关于处理车联网有关应用中的个人数据的第01/2020号指南》"
                  },
                  {
                    "value": "《关于2016/679号条例第46 (2) (a) 条和第46 (3) (b) 条在欧盟和非欧盟公共机构之间个人数据传输的第02/2020号指南》",
                    "label": "《关于2016/679号条例第46 (2) (a) 条和第46 (3) (b) 条在欧盟和非欧盟公共机构之间个人数据传输的第02/2020号指南》"
                  },
                  {
                    "value": "《关于新冠疫情背景下的科学研究目的处理健康数据的第03/2020号指南》",
                    "label": "《关于新冠疫情背景下的科学研究目的处理健康数据的第03/2020号指南》"
                  },
                  {
                    "value": "《关于在新冠疫情中使用位置数据和接触者追踪工具的第04/2020号指南》",
                    "label": "《关于在新冠疫情中使用位置数据和接触者追踪工具的第04/2020号指南》"
                  },
                  {
                    "value": "《关于 2016/679号条例项下同意条款的第05/2020号指南》",
                    "label": "《关于 2016/679号条例项下同意条款的第05/2020号指南》"
                  },
                  {
                    "value": "《关于〈支付服务指令ⅱ〉和gdpr的协调适用关系的第06/2020号指南》",
                    "label": "《关于〈支付服务指令Ⅱ〉和GDPR的协调适用关系的第06/2020号指南》"
                  },
                  {
                    "value": "《关于gdpr 中数据控制者和数据处理者概念的第07/2020号指南》",
                    "label": "《关于GDPR 中数据控制者和数据处理者概念的第07/2020号指南》"
                  },
                  {
                    "value": "《关于社交媒体用户提供定向服务的第08/2020号准则》",
                    "label": "《关于社交媒体用户提供定向服务的第08/2020号准则》"
                  },
                  {
                    "value": "《关于2016/679号条例项下的相关和合理异议的第09/2020号指南》",
                    "label": "《关于2016/679号条例项下的相关和合理异议的第09/2020号指南》"
                  },
                  {
                    "value": "《关于gdpr第23条项下的限制主体权利的第10/2020号指南》",
                    "label": "《关于GDPR第23条项下的限制主体权利的第10/2020号指南》"
                  },
                  {
                    "value": "《关于采取传输t具补充措施以确保符合欧盟个人数据保护水平的第01/2020号建议》",
                    "label": "《关于采取传输T具补充措施以确保符合欧盟个人数据保护水平的第01/2020号建议》"
                  },
                  {
                    "value": "《针对监控措施的关丁欧盟重要保障的第002/2020号建议》",
                    "label": "《针对监控措施的关丁欧盟重要保障的第002/2020号建议》"
                  },
                  {
                    "value": "《关于通过视频设备处理个人数据的第03/2019号指南》",
                    "label": "《关于通过视频设备处理个人数据的第03/2019号指南》"
                  },
                  {
                    "value": "《关于gipk 下搜索引擎案件中被遗忘权认定标准的第05/2019号指南(第1部分) 》",
                    "label": "《关于GIPK 下搜索引擎案件中被遗忘权认定标准的第05/2019号指南(第1部分) 》"
                  },
                  {
                    "value": "《关于 (hdpr第25条的设计和默认隐私保护2.0的第04/2019号指南》",
                    "label": "《关于 (HDPR第25条的设计和默认隐私保护2.0的第04/2019号指南》"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "value": "知识产权",
        "label": "知识产权",
        "children": [
          {
            "value": "● 条约",
            "label": "● 条约",
            "children": [
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "《马德里议定书》",
                "label": "《马德里议定书》"
              },
              {
                "value": "《",
                "label": "《"
              },
              {
                "value": "《与贸易（包括假冒商品贸易在内的）有关的知识产权协定》",
                "label": "《与贸易（包括假冒商品贸易在内的）有关的知识产权协定》"
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              }
            ]
          },
          {
            "value": "",
            "label": "",
            "children": [
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              }
            ]
          },
          {
            "value": "",
            "label": "",
            "children": [
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "第三国知识产权 执法战略（2005/c 129/03）",
                "label": "第三国知识产权 执法战略（2005/C 129/03）"
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              }
            ]
          }
        ]
      },
      {
        "value": "国家安全",
        "label": "国家安全",
        "children": [
          {
            "value": "● 指令",
            "label": "● 指令",
            "children": [
              {
                "value": "● 《一般数据保护条例》(gdpr)《2016/680指令》《2018/1725指令》",
                "label": "● 《一般数据保护条例》(GDPR)《2016/680指令》《2018/1725指令》"
              }
            ]
          },
          {
            "value": "● 指南",
            "label": "● 指南",
            "children": [
              {
                "value": "《关于处理车联网有关应用中的个人数据的第01/2020号指南》",
                "label": "《关于处理车联网有关应用中的个人数据的第01/2020号指南》"
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              }
            ]
          },
          {
            "value": "● 建议",
            "label": "● 建议",
            "children": [
              {
                "value": "",
                "label": ""
              },
              {
                "value": "",
                "label": ""
              }
            ]
          }
        ]
      },
      {
        "value": "工程承包",
        "label": "工程承包",
        "children": [
          {
            "value": "● 法律",
            "label": "● 法律",
            "children": [
              {
                "value": "● 欧洲土地法典： european code on land law，编号： com(2003) 71 final",
                "label": "● 欧洲土地法典： European Code on Land Law，编号： COM(2003) 71 final"
              }
            ]
          },
          {
            "value": "● 判例",
            "label": "● 判例",
            "children": [
              {
                "value": "● 2023 年 10 月 12 日法院（第一分庭）的判决（要求爱沙尼亚塔林纳哈尔杜斯科胡斯做出初步裁决）——est wind power oü v elering as（案例 c-11/22，",
                "label": "● 2023 年 10 月 12 日法院（第一分庭）的判决（要求爱沙尼亚塔林纳哈尔杜斯科胡斯做出初步裁决）——Est Wind Power OÜ v Elering AS（案例 C-11/22，"
              },
              {
                "value": "● 2010年10月7日法院（第五分庭）判决（参考意大利博尔扎诺法庭的初步裁决）——对玛莎·努斯鲍默的刑事诉讼（案件编号c-224/09）",
                "label": "● 2010年10月7日法院（第五分庭）判决（参考意大利博尔扎诺法庭的初步裁决）——对玛莎·努斯鲍默的刑事诉讼（案件编号C-224/09）"
              }
            ]
          },
          {
            "value": "● 指令",
            "label": "● 指令",
            "children": [
              {
                "value": "● 欧洲土地资源保护指令：european directive on protection of soil resources，编号：2004/35/ec",
                "label": "● 欧洲土地资源保护指令：European Directive on Protection of Soil Resources，编号：2004/35/EC"
              },
              {
                "value": "● 关于欧盟土地使用和开发指令：european directive onland use and development，编号：2011/92/eu",
                "label": "● 关于欧盟土地使用和开发指令：European Directive onLand Use and Development，编号：2011/92/EU"
              },
              {
                "value": "● 欧洲议会和理事会指令 （eu） 2021/1883 关于第三国国民为高素质就业而入境和居住的条件，并废除理事会指令 2009/50/ec",
                "label": "● 欧洲议会和理事会指令 （EU） 2021/1883 关于第三国国民为高素质就业而入境和居住的条件，并废除理事会指令 2009/50/EC"
              },
              {
                "value": "● 欧洲议会和理事会指令 2014/54/eu   在工人行动自由的背景下，便利行使赋予工人的权利的措施（与欧洲经济区相关的文本）",
                "label": "● 欧洲议会和理事会指令 2014/54/EU   在工人行动自由的背景下，便利行使赋予工人的权利的措施（与欧洲经济区相关的文本）"
              },
              {
                "value": "● 指南",
                "label": "● 指南"
              },
              {
                "value": "●  欧洲土地利用规划指南：european guidelines for land use planning，编号：com(1999) 224 final",
                "label": "●  欧洲土地利用规划指南：European Guidelines for Land Use Planning，编号：COM(1999) 224 final"
              }
            ]
          }
        ]
      },
      {
        "value": "税收",
        "label": "税收",
        "children": [
          {
            "value": "条约",
            "label": "条约",
            "children": [
              {
                "value": "《欧共体条约》",
                "label": "《欧共体条约》"
              },
              {
                "value": "中国与欧盟各成员国签订避免双重征税双边协定",
                "label": "中国与欧盟各成员国签订避免双重征税双边协定"
              },
              {
                "value": "·中国与欧洲国家税收协定",
                "label": "·中国与欧洲国家税收协定"
              }
            ]
          },
          {
            "value": "法律法规",
            "label": "法律法规",
            "children": [
              {
                "value": "税务合作指令",
                "label": "税务合作指令"
              },
              {
                "value": "欧洲税收透明度指令",
                "label": "欧洲税收透明度指令"
              },
              {
                "value": "争端解决机制指令",
                "label": "争端解决机制指令"
              },
              {
                "value": "税收逃漏和避税预警指令",
                "label": "税收逃漏和避税预警指令"
              },
              {
                "value": "增值税指令",
                "label": "增值税指令"
              }
            ]
          },
          {
            "value": "条例",
            "label": "条例",
            "children": [
              {
                "value": "跨境交易增值税条例",
                "label": "跨境交易增值税条例"
              }
            ]
          },
          {
            "value": "判例法",
            "label": "判例法",
            "children": [
              {
                "value": "进口生产资料税抵免案（case c-69/91）",
                "label": "进口生产资料税抵免案（Case C-69/91）"
              },
              {
                "value": "欧元货币税（case c-384/09）",
                "label": "欧元货币税（Case C-384/09）"
              },
              {
                "value": "违反国家援助规定的税收减免案（case c-172/03）",
                "label": "违反国家援助规定的税收减免案（Case C-172/03）"
              }
            ]
          },
          {
            "value": "指南",
            "label": "指南",
            "children": [
              {
                "value": "消费税指南",
                "label": "消费税指南"
              },
              {
                "value": "内部市场和关税同盟指南",
                "label": "内部市场和关税同盟指南"
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "核算税指南",
                "label": "核算税指南"
              },
              {
                "value": "跨越国境合理分配利润指南",
                "label": "跨越国境合理分配利润指南"
              },
              {
                "value": "欧盟税收政策指南",
                "label": "欧盟税收政策指南"
              }
            ]
          }
        ]
      },
      {
        "value": "环境保护",
        "label": "环境保护",
        "children": [
          {
            "value": "条约",
            "label": "条约",
            "children": [
              {
                "value": "《欧洲联盟运作条约》第191，第193条；附加议定书第二部分",
                "label": "《欧洲联盟运作条约》第191，第193条；附加议定书第二部分"
              },
              {
                "value": "《生态系统和生物多样性战略》",
                "label": "《生态系统和生物多样性战略》"
              },
              {
                "value": "《气候变化框架公约》",
                "label": "《气候变化框架公约》"
              },
              {
                "value": "《京都议定书》",
                "label": "《京都议定书》"
              }
            ]
          },
          {
            "value": "法律法规",
            "label": "法律法规",
            "children": [
              {
                "value": "水框架指令2000/60/ec",
                "label": "水框架指令2000/60/EC"
              },
              {
                "value": "工业排放指令2010/75/eu",
                "label": "工业排放指令2010/75/EU"
              },
              {
                "value": "包装和包装废物指令1994/62/ec",
                "label": "包装和包装废物指令1994/62/EC"
              },
              {
                "value": "废物框架指令2008/98/ec",
                "label": "废物框架指令2008/98/EC"
              },
              {
                "value": "溶剂排放指令1999/13/ec",
                "label": "溶剂排放指令1999/13/EC"
              },
              {
                "value": "生物多样性和自然栖息地保护指令92/43/eec",
                "label": "生物多样性和自然栖息地保护指令92/43/EEC"
              },
              {
                "value": "植物保护产品指令2009/128/ec",
                "label": "植物保护产品指令2009/128/EC"
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "食品接触材料指令2004/1935/ec",
                "label": "食品接触材料指令2004/1935/EC"
              },
              {
                "value": "氟利昂气体指令517/2014",
                "label": "氟利昂气体指令517/2014"
              },
              {
                "value": "企业责任法中《欧盟 2020战略：在经济、环境和社会三方面推动智能、可持续和包容性增长》《企业信息披露指令》",
                "label": "企业责任法中《欧盟 2020战略：在经济、环境和社会三方面推动智能、可持续和包容性增长》《企业信息披露指令》"
              }
            ]
          },
          {
            "value": "条例",
            "label": "条例",
            "children": [
              {
                "value": "欧盟渔业和海洋污染条例（eu regulation 1005/2008）",
                "label": "欧盟渔业和海洋污染条例（EU Regulation 1005/2008）"
              },
              {
                "value": "欧洲气候和能源框架法（european climate and energy framework law）",
                "label": "欧洲气候和能源框架法（European Climate and Energy Framework Law）"
              },
              {
                "value": "欧盟化学品考评、授权和限制条例（reach regulation ec no 1907/2006）",
                "label": "欧盟化学品考评、授权和限制条例（REACH Regulation EC No 1907/2006）"
              },
              {
                "value": "欧盟水产养殖条例（eu aquaculture regulation 2014/304）",
                "label": "欧盟水产养殖条例（EU Aquaculture Regulation 2014/304）"
              },
              {
                "value": "欧盟环境纪录公开条例（eu regulation 1367/2006）",
                "label": "欧盟环境纪录公开条例（EU Regulation 1367/2006）"
              }
            ]
          },
          {
            "value": "判例",
            "label": "判例",
            "children": [
              {
                "value": "天然保护法",
                "label": "天然保护法"
              },
              {
                "value": "产品法案",
                "label": "产品法案"
              },
              {
                "value": "",
                "label": ""
              },
              {
                "value": "生态平衡法",
                "label": "生态平衡法"
              },
              {
                "value": "natura 2000判例法",
                "label": "Natura 2000判例法"
              }
            ]
          },
          {
            "value": "指南",
            "label": "指南",
            "children": [
              {
                "value": "1. 欧盟液化天然气基础设施和燃料统一标准的技术指南",
                "label": "1. 欧盟液化天然气基础设施和燃料统一标准的技术指南"
              },
              {
                "value": "2. 欧盟对大气污染物排放的在线监测和报告的指南及数据交换标准",
                "label": "2. 欧盟对大气污染物排放的在线监测和报告的指南及数据交换标准"
              },
              {
                "value": "3. 欧盟有害化学物质评估的技术指南",
                "label": "3. 欧盟有害化学物质评估的技术指南"
              },
              {
                "value": "4. 欧盟烷基苯类物质的风险评估指南",
                "label": "4. 欧盟烷基苯类物质的风险评估指南"
              },
              {
                "value": "5. 欧盟废物的分类和转移指南",
                "label": "5. 欧盟废物的分类和转移指南"
              },
              {
                "value": "6. 欧盟对环境和气候因素强调风险评估的指导",
                "label": "6. 欧盟对环境和气候因素强调风险评估的指导"
              },
              {
                "value": "7. 欧盟船舶废物处理技术与标准细则指南",
                "label": "7. 欧盟船舶废物处理技术与标准细则指南"
              },
              {
                "value": "8. 欧盟对工业排放指令以及新工业污染控制指令的实施指南",
                "label": "8. 欧盟对工业排放指令以及新工业污染控制指令的实施指南"
              },
              {
                "value": "9. 欧盟环境关键基础设施的生态设计指导方针",
                "label": "9. 欧盟环境关键基础设施的生态设计指导方针"
              }
            ]
          }
        ]
      },
      {
        "value": "土地",
        "label": "土地",
        "children": [
          {
            "value": "条约",
            "label": "条约",
            "children": [
              {
                "value": "欧盟与中国之间的投资协定",
                "label": "欧盟与中国之间的投资协定"
              }
            ]
          },
          {
            "value": "法律法规",
            "label": "法律法规",
            "children": [
              {
                "value": "",
                "label": ""
              },
              {
                "value": "欧洲土地资源保护指令",
                "label": "欧洲土地资源保护指令"
              },
              {
                "value": "欧盟土地征收指令",
                "label": "欧盟土地征收指令"
              },
              {
                "value": "关于欧盟土地使用和开发指令",
                "label": "关于欧盟土地使用和开发指令"
              },
              {
                "value": "关于欧洲城市规划指南",
                "label": "关于欧洲城市规划指南"
              }
            ]
          },
          {
            "value": "条例",
            "label": "条例",
            "children": [
              {
                "value": "欧盟土地保护条例",
                "label": "欧盟土地保护条例"
              },
              {
                "value": "关于欧洲土地空间规划",
                "label": "关于欧洲土地空间规划"
              }
            ]
          },
          {
            "value": "判例法",
            "label": "判例法",
            "children": [
              {
                "value": "欧盟环境评估法（eia）的判例法，案例包括：t-177/12、c-420/87和c-127/02",
                "label": "欧盟环境评估法（EIA）的判例法，案例包括：T-177/12、C-420/87和C-127/02"
              }
            ]
          },
          {
            "value": "指南",
            "label": "指南",
            "children": [
              {
                "value": "欧洲土地利用规划指南",
                "label": "欧洲土地利用规划指南"
              },
              {
                "value": "关于欧盟土地资源开发指南",
                "label": "关于欧盟土地资源开发指南"
              },
              {
                "value": "欧盟城市土地使用规划指南",
                "label": "欧盟城市土地使用规划指南"
              }
            ]
          }
        ]
      },
      {
        "value": "投资",
        "label": "投资",
        "children": [
          {
            "value": "条约",
            "label": "条约",
            "children": [
              {
                "value": "1《区域全面经济伙伴关系协定》（rcep）第十二章：投资，包括投资政策、投资自由化和便利化等方面的规定。",
                "label": "1《区域全面经济伙伴关系协定》（RCEP）第十二章：投资，包括投资政策、投资自由化和便利化等方面的规定。"
              },
              {
                "value": "2《欧洲自由贸易联盟》：投资与贸易领域的协调（第十三章 资本自由流动），投资保护（第十四章 知识产权保护和关于国民待遇、最惠国待遇的投资条款），讨论投资领域合作的机会（附录十三-e 欧洲自由贸易联盟国家和南美南方共同市场关于贸易、投资和创新合作的讨论）",
                "label": "2《欧洲自由贸易联盟》：投资与贸易领域的协调（第十三章 资本自由流动），投资保护（第十四章 知识产权保护和关于国民待遇、最惠国待遇的投资条款），讨论投资领域合作的机会（附录十三-E 欧洲自由贸易联盟国家和南美南方共同市场关于贸易、投资和创新合作的讨论）"
              }
            ]
          },
          {
            "value": "法律法规",
            "label": "法律法规",
            "children": [
              {
                "value": "1《欧盟外商直接投资审查条例》",
                "label": "1《欧盟外商直接投资审查条例》"
              },
              {
                "value": "2《欧洲证券市场法规》",
                "label": "2《欧洲证券市场法规》"
              },
              {
                "value": "3《简化债务重组和破产规则法规》",
                "label": "3《简化债务重组和破产规则法规》"
              }
            ]
          },
          {
            "value": "条例",
            "label": "条例",
            "children": [
              {
                "value": "1《欧盟成员国关于外商直接投资审查的指引》",
                "label": "1《欧盟成员国关于外商直接投资审查的指引》"
              },
              {
                "value": "2《欧盟成员国本国审查机制》",
                "label": "2《欧盟成员国本国审查机制》"
              }
            ]
          },
          {
            "value": "判例",
            "label": "判例",
            "children": [
              {
                "value": "1，第c-98/11 p号案件 - 液晶面板制造商的价格操纵违反投资自由和贸易自由原则",
                "label": "1，第C-98/11 P号案件 - 液晶面板制造商的价格操纵违反投资自由和贸易自由原则"
              },
              {
                "value": "2，c-529/16 e和其他人诉欧洲委员会案，此案涉及到财政资助和国有企业剥离问题。",
                "label": "2，C-529/16 E和其他人诉欧洲委员会案，此案涉及到财政资助和国有企业剥离问题。"
              }
            ]
          },
          {
            "value": "指南",
            "label": "指南",
            "children": [
              {
                "value": "1《投资保护指南》",
                "label": "1《投资保护指南》"
              },
              {
                "value": "2 《投资协定进程指南》",
                "label": "2 《投资协定进程指南》"
              },
              {
                "value": "3《 投资协定进程指南》",
                "label": "3《 投资协定进程指南》"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "value": "美国（以联邦法律为主）",
    "label": "美国（以联邦法律为主）",
    "children": [
      {
        "value": "投资法律制度及其政策",
        "label": "投资法律制度及其政策",
        "children": [
          {
            "value": "机构：国防生产法产生 cfius",
            "label": "机构：国防生产法产生 CFIUS"
          },
          {
            "value": "投资方式",
            "label": "投资方式",
            "children": [
              {
                "value": "地方政府主管部门对接 cfius监管",
                "label": "地方政府主管部门对接 CFIUS监管"
              }
            ]
          },
          {
            "value": "投资法规",
            "label": "投资法规",
            "children": [
              {
                "value": "联邦",
                "label": "联邦",
                "children": [
                  {
                    "value": "1935年《社会保障法》及修正案",
                    "label": "1935年《社会保障法》及修正案"
                  }
                ]
              }
            ]
          },
          {
            "value": "敏感行业投资限制",
            "label": "敏感行业投资限制",
            "children": [
              {
                "value": "航空运输投票权百分之25 董事会三分之一",
                "label": "航空运输投票权百分之25 董事会三分之一"
              },
              {
                "value": "通信 禁止获得经营许可 严格限制投资",
                "label": "通信 禁止获得经营许可 严格限制投资"
              },
              {
                "value": "核电 仅限本国",
                "label": "核电 仅限本国"
              },
              {
                "value": "水电 允许外国控制的美国公司从事通航河流水电开发",
                "label": "水电 允许外国控制的美国公司从事通航河流水电开发"
              },
              {
                "value": "基础设施 对等原则",
                "label": "基础设施 对等原则"
              }
            ]
          },
          {
            "value": "对外优惠政策（各州具体决定）",
            "label": "对外优惠政策（各州具体决定）"
          },
          {
            "value": "特别经济区规定",
            "label": "特别经济区规定"
          }
        ]
      },
      {
        "value": "贸易法律制度",
        "label": "贸易法律制度",
        "children": [
          {
            "value": "贸易法规",
            "label": "贸易法规",
            "children": [
              {
                "value": "1988年综合竞争贸易法",
                "label": "1988年综合竞争贸易法"
              },
              {
                "value": "《h.r.875-2016年跨境贸易促进法》（h.r.875 - cross-border trade enhancement act of 2016）",
                "label": "《H.R.875-2016年跨境贸易促进法》（H.R.875 - Cross-Border Trade Enhancement Act of 2016）"
              },
              {
                "value": "《h.r.644-2015年贸易便利化和贸易执行法》（h.r.644 - trade facilitation and trade enforcement act of 2015）",
                "label": "《H.R.644-2015年贸易便利化和贸易执行法》（H.R.644 - Trade Facilitation and Trade Enforcement Act of 2015）"
              }
            ]
          },
          {
            "value": "进口管理制度",
            "label": "进口管理制度",
            "children": [
              {
                "value": "关税调节",
                "label": "关税调节"
              },
              {
                "value": "1972年海洋哺乳动物保护法",
                "label": "1972年海洋哺乳动物保护法"
              },
              {
                "value": "1962贸易拓展法",
                "label": "1962贸易拓展法"
              },
              {
                "value": "1974年贸易法122条款",
                "label": "1974年贸易法122条款"
              }
            ]
          },
          {
            "value": "出口管理制度",
            "label": "出口管理制度",
            "children": [
              {
                "value": "1979年出口管理法",
                "label": "1979年出口管理法"
              },
              {
                "value": "武器出口管制法案",
                "label": "武器出口管制法案"
              },
              {
                "value": "联邦",
                "label": "联邦",
                "children": [
                  {
                    "value": "《出口管制改革法案》",
                    "label": "《出口管制改革法案》"
                  },
                  {
                    "value": "《出口管制条例》",
                    "label": "《出口管制条例》"
                  },
                  {
                    "value": "《商业管制清单》和《商业国家列表》",
                    "label": "《商业管制清单》和《商业国家列表》"
                  }
                ]
              }
            ]
          },
          {
            "value": "反商业贿赂法规",
            "label": "反商业贿赂法规",
            "children": [
              {
                "value": "各州单独立法",
                "label": "各州单独立法"
              },
              {
                "value": "联邦",
                "label": "联邦",
                "children": [
                  {
                    "value": "美国反海外腐败法案",
                    "label": "美国反海外腐败法案"
                  }
                ]
              }
            ]
          },
          {
            "value": "美国参加缔结的国际贸易条约、协定",
            "label": "美国参加缔结的国际贸易条约、协定",
            "children": [
              {
                "value": "多边条约（美国缔结时间顺序排列）",
                "label": "多边条约（美国缔结时间顺序排列）",
                "children": [
                  {
                    "value": "承认及执行外国仲裁裁决公约（un）",
                    "label": "承认及执行外国仲裁裁决公约（UN）"
                  },
                  {
                    "value": "货物凭a.t.a.报关单证册暂时进口的海关公约（wco）",
                    "label": "货物凭A.T.A.报关单证册暂时进口的海关公约（WCO）"
                  },
                  {
                    "value": "关于解决国家和他国国民之间投资争端公约（wbg）",
                    "label": "关于解决国家和他国国民之间投资争端公约（WBG）"
                  },
                  {
                    "value": "内陆国家过境贸易公约（un）",
                    "label": "内陆国家过境贸易公约（UN）"
                  },
                  {
                    "value": "国际易腐食品运输及其所用特别设备协定（易腐食品运输协定）（un）",
                    "label": "国际易腐食品运输及其所用特别设备协定（易腐食品运输协定）（UN）"
                  },
                  {
                    "value": "集装箱关务公约（un）    关于简化和协调海关业务制度的国际公约（京都公约）（wco）",
                    "label": "集装箱关务公约（UN）    关于简化和协调海关业务制度的国际公约（京都公约）（WCO）"
                  },
                  {
                    "value": "联合国国际货物销售时效公约（un）",
                    "label": "联合国国际货物销售时效公约（UN）"
                  },
                  {
                    "value": "＞关于国际公路货运通行证制度下国际货运海关公约（国际公路货运公约）（un）",
                    "label": "＞关于国际公路货运通行证制度下国际货运海关公约（国际公路货运公约）（UN）"
                  },
                  {
                    "value": "民用航空器贸易协议（wto）",
                    "label": "民用航空器贸易协议（WTO）"
                  },
                  {
                    "value": "联合国国际货物销售合同公约（un）",
                    "label": "联合国国际货物销售合同公约（UN）"
                  },
                  {
                    "value": "商品名称及编码协调制度的国际公约（wco）",
                    "label": "商品名称及编码协调制度的国际公约（WCO）"
                  },
                  {
                    "value": "1986年－1994年关贸总协定／世贸组织乌拉圭回合谈判相关协定（wto）        建立世界贸易组织的马拉喀什协议» 1994年关税与贸易总协定（gatt）",
                    "label": "1986年－1994年关贸总协定／世贸组织乌拉圭回合谈判相关协定（WTO）        建立世界贸易组织的马拉喀什协议» 1994年关税与贸易总协定（GATT）",
                    "children": [
                      {
                        "value": "农业协议",
                        "label": "农业协议"
                      },
                      {
                        "value": "实施卫生与植物卫生措施协议",
                        "label": "实施卫生与植物卫生措施协议"
                      },
                      {
                        "value": "纺织品与服装协定» 技术性贸易壁垒协议",
                        "label": "纺织品与服装协定» 技术性贸易壁垒协议"
                      },
                      {
                        "value": "与贸易有关的投资措施协议» 关于执行1994年关贸总协定第六条的协议（反倾销协议）",
                        "label": "与贸易有关的投资措施协议» 关于执行1994年关贸总协定第六条的协议（反倾销协议）"
                      },
                      {
                        "value": "关于实施1994年关税与贸易总协定第七条的协定（海关估价协定）",
                        "label": "关于实施1994年关税与贸易总协定第七条的协定（海关估价协定）"
                      },
                      {
                        "value": "装运前检验协议» 政府采购协定» 原产地规则协议» 进口许可程序协议» 补贴与反补贴措施协议",
                        "label": "装运前检验协议» 政府采购协定» 原产地规则协议» 进口许可程序协议» 补贴与反补贴措施协议"
                      },
                      {
                        "value": "保障措施协议» 服务贸易总协定（gats）",
                        "label": "保障措施协议» 服务贸易总协定（GATS）"
                      },
                      {
                        "value": "与贸易有关的知识产权协",
                        "label": "与贸易有关的知识产权协"
                      },
                      {
                        "value": "关于争端解决规则与程序的谅解",
                        "label": "关于争端解决规则与程序的谅解"
                      },
                      {
                        "value": "贸易政策审议机制» 国际牛肉协议",
                        "label": "贸易政策审议机制» 国际牛肉协议"
                      },
                      {
                        "value": "1995年谷物贸易公约（un）",
                        "label": "1995年谷物贸易公约（UN）"
                      },
                      {
                        "value": "服务贸易总协定第四议定书（wto）",
                        "label": "服务贸易总协定第四议定书（WTO）"
                      },
                      {
                        "value": "服务贸易总协定第五议定书（wto）",
                        "label": "服务贸易总协定第五议定书（WTO）"
                      },
                      {
                        "value": "粮食援助公约（2012年4月25日，伦敦） （un）",
                        "label": "粮食援助公约（2012年4月25日，伦敦） （UN）"
                      }
                    ]
                  }
                ]
              },
              {
                "value": "区域经济一体化条约",
                "label": "区域经济一体化条约",
                "children": [
                  {
                    "value": "加拿大政府，墨西哥合众国政府和美利坚合众国政府间北美自由贸易协定（修订文本仍在谈判中）",
                    "label": "加拿大政府，墨西哥合众国政府和美利坚合众国政府间北美自由贸易协定（修订文本仍在谈判中）"
                  },
                  {
                    "value": "中美洲自由贸易协定，签约其他国家包括哥斯达黎加、多米尼加共和国、萨尔瓦多、危地马拉、洪都拉斯、尼加拉瓜。",
                    "label": "中美洲自由贸易协定，签约其他国家包括哥斯达黎加、多米尼加共和国、萨尔瓦多、危地马拉、洪都拉斯、尼加拉瓜。"
                  },
                  {
                    "value": "跨大西洋贸易与投资伙伴关系协定（ttip）（谈判中）",
                    "label": "跨大西洋贸易与投资伙伴关系协定（TTIP）（谈判中）"
                  }
                ]
              },
              {
                "value": "双边条约",
                "label": "双边条约",
                "children": [
                  {
                    "value": "双边投资协定",
                    "label": "双边投资协定",
                    "children": [
                      {
                        "value": "www.state.gov",
                        "label": "www.state.gov"
                      }
                    ]
                  },
                  {
                    "value": "自由贸易协定（12个签署国）",
                    "label": "自由贸易协定（12个签署国）",
                    "children": [
                      {
                        "value": "澳大利亚(australian fta)",
                        "label": "澳大利亚(Australian FTA)"
                      },
                      {
                        "value": "巴林(bahrain f ta)",
                        "label": "巴林(Bahrain F TA)"
                      },
                      {
                        "value": "智利 (chile ft a)",
                        "label": "智利 (Chile FT A)"
                      },
                      {
                        "value": "哥伦比亚(colombia tpa)",
                        "label": "哥伦比亚(Colombia TPA)"
                      },
                      {
                        "value": "以色列(israel f ta)",
                        "label": "以色列(Israel F TA)"
                      },
                      {
                        "value": "约旦(jordan f ta)",
                        "label": "约旦(Jordan F TA)"
                      },
                      {
                        "value": "韩国(korus f ta)",
                        "label": "韩国(KORUS F TA)"
                      },
                      {
                        "value": "摩洛哥(morocco fta)",
                        "label": "摩洛哥(Morocco FTA)"
                      },
                      {
                        "value": "阿曼(oman ft a)",
                        "label": "阿曼(Oman FT A)"
                      },
                      {
                        "value": "巴拿马(panamatpa)",
                        "label": "巴拿马(PanamaTPA)"
                      },
                      {
                        "value": "秘鲁(peru tp a)",
                        "label": "秘鲁(Peru TP A)"
                      },
                      {
                        "value": "新加坡(singapore fta)",
                        "label": "新加坡(Singapore FTA)"
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "value": "证券交易",
        "label": "证券交易",
        "children": [
          {
            "value": "1933证券法",
            "label": "1933证券法"
          },
          {
            "value": "1934证券交易法",
            "label": "1934证券交易法"
          },
          {
            "value": "1940投资公司法",
            "label": "1940投资公司法"
          },
          {
            "value": "1950年《标准公司法》11-13章中关于收购上市公司的规定",
            "label": "1950年《标准公司法》11-13章中关于收购上市公司的规定"
          }
        ]
      },
      {
        "value": "劳动",
        "label": "劳动",
        "children": [
          {
            "value": "联邦",
            "label": "联邦",
            "children": [
              {
                "value": "《国家劳资关系法案》（1935年）",
                "label": "《国家劳资关系法案》（1935年）"
              },
              {
                "value": "《1964年民权法案第七章》（1964）",
                "label": "《1964年民权法案第七章》（1964）"
              },
              {
                "value": "《1967年反劳动者年龄歧视法》（ 1967）",
                "label": "《1967年反劳动者年龄歧视法》（ 1967）"
              },
              {
                "value": "《美国残疾人法案》（ 1990）",
                "label": "《美国残疾人法案》（ 1990）"
              },
              {
                "value": "《家庭与医疗休假法》",
                "label": "《家庭与医疗休假法》"
              },
              {
                "value": "《公平劳动标准法》",
                "label": "《公平劳动标准法》"
              },
              {
                "value": "《军人就业及再就业权利法》",
                "label": "《军人就业及再就业权利法》"
              },
              {
                "value": "《同酬法案》",
                "label": "《同酬法案》"
              },
              {
                "value": "《雇员退休收入保障法》",
                "label": "《雇员退休收入保障法》"
              },
              {
                "value": "《综合预算协调法》",
                "label": "《综合预算协调法》"
              },
              {
                "value": "《1970年职业安全和健康法》",
                "label": "《1970年职业安全和健康法》"
              },
              {
                "value": "《移民改革及控制法案》",
                "label": "《移民改革及控制法案》"
              },
              {
                "value": "《劳资报告与公告法》",
                "label": "《劳资报告与公告法》"
              }
            ]
          },
          {
            "value": "纽约州",
            "label": "纽约州",
            "children": [
              {
                "value": "《纽约州劳动法》",
                "label": "《纽约州劳动法》"
              },
              {
                "value": "《带薪安全和病假法案》",
                "label": "《带薪安全和病假法案》"
              },
              {
                "value": "1935年《社会保障法》及修正案",
                "label": "1935年《社会保障法》及修正案"
              }
            ]
          }
        ]
      },
      {
        "value": "环境保护",
        "label": "环境保护",
        "children": [
          {
            "value": "联邦",
            "label": "联邦",
            "children": [
              {
                "value": "《联邦水污染控制法》（1948年）",
                "label": "《联邦水污染控制法》（1948年）"
              },
              {
                "value": "《联邦杀虫剂、灭菌剂及灭鼠剂法》（1947年）",
                "label": "《联邦杀虫剂、灭菌剂及灭鼠剂法》（1947年）"
              },
              {
                "value": "《原子能法》（1954年）",
                "label": "《原子能法》（1954年）"
              },
              {
                "value": "《联邦大气污染控制法》（1955年）",
                "label": "《联邦大气污染控制法》（1955年）"
              },
              {
                "value": "《联邦有害物质法》（1960年）",
                "label": "《联邦有害物质法》（1960年）"
              },
              {
                "value": "《鱼类和野生生物协调法》（1965年）",
                "label": "《鱼类和野生生物协调法》（1965年）"
              },
              {
                "value": "《空气质量法》（1967年）",
                "label": "《空气质量法》（1967年）"
              },
              {
                "value": "《自然和风景河流法》（1968年）",
                "label": "《自然和风景河流法》（1968年）"
              },
              {
                "value": "《环境质量改善法》（1970年）",
                "label": "《环境质量改善法》（1970年）"
              },
              {
                "value": "《美国环境教育法》（1970年）",
                "label": "《美国环境教育法》（1970年）"
              },
              {
                "value": "《海岸带管理法》（1972年）",
                "label": "《海岸带管理法》（1972年）"
              },
              {
                "value": "《海洋哺乳动物保护法》（1972年）",
                "label": "《海洋哺乳动物保护法》（1972年）"
              },
              {
                "value": "《海洋保护研究及禁渔区法》（1972年）",
                "label": "《海洋保护研究及禁渔区法》（1972年）"
              },
              {
                "value": "《联邦环境杀虫剂控制法》（1972年）",
                "label": "《联邦环境杀虫剂控制法》（1972年）"
              },
              {
                "value": "《噪声控制法》（1972年）",
                "label": "《噪声控制法》（1972年）"
              },
              {
                "value": "《安全饮用水法》（1974年）",
                "label": "《安全饮用水法》（1974年）"
              },
              {
                "value": "《濒危物种法》（1973年）",
                "label": "《濒危物种法》（1973年）"
              },
              {
                "value": "《联邦土地政策及管理法》（1976年）",
                "label": "《联邦土地政策及管理法》（1976年）"
              },
              {
                "value": "《有毒物质运输法》（1975年）",
                "label": "《有毒物质运输法》（1975年）"
              },
              {
                "value": "《资源保护与回收法》（1976年）",
                "label": "《资源保护与回收法》（1976年）"
              },
              {
                "value": "《有毒物质控制法》（1976年）",
                "label": "《有毒物质控制法》（1976年）"
              },
              {
                "value": "《酸雨法》（1980年）",
                "label": "《酸雨法》（1980年）"
              },
              {
                "value": "《机动车燃料效益法》（1980年）",
                "label": "《机动车燃料效益法》（1980年）"
              },
              {
                "value": "《生物量及酒精燃料法》（1980年）",
                "label": "《生物量及酒精燃料法》（1980年）"
              },
              {
                "value": "《固体废物处置法》（1980年）",
                "label": "《固体废物处置法》（1980年）"
              },
              {
                "value": "《核废弃物政策法》（1982年）",
                "label": "《核废弃物政策法》（1982年）"
              }
            ]
          }
        ]
      },
      {
        "value": "(外企)工程承包规定",
        "label": "(外企)工程承包规定",
        "children": [
          {
            "value": "一般商法",
            "label": "一般商法"
          },
          {
            "value": "外企获得土地规定",
            "label": "外企获得土地规定",
            "children": [
              {
                "value": "土地法",
                "label": "土地法"
              },
              {
                "value": "土地买卖各州制定",
                "label": "土地买卖各州制定"
              }
            ]
          }
        ]
      },
      {
        "value": "知识产权保护",
        "label": "知识产权保护",
        "children": [
          {
            "value": "专利法",
            "label": "专利法"
          },
          {
            "value": "商标法",
            "label": "商标法"
          },
          {
            "value": "版权法",
            "label": "版权法"
          },
          {
            "value": "反不正当竞争法",
            "label": "反不正当竞争法"
          },
          {
            "value": "乌拉圭回合协议法",
            "label": "乌拉圭回合协议法"
          },
          {
            "value": "莱希-史密斯美国发明创造法",
            "label": "莱希-史密斯美国发明创造法"
          }
        ]
      },
      {
        "value": "反垄断",
        "label": "反垄断",
        "children": [
          {
            "value": "联邦",
            "label": "联邦",
            "children": [
              {
                "value": "《综合贸易与竞争法》（1988）",
                "label": "《综合贸易与竞争法》（1988）"
              },
              {
                "value": "《谢尔曼法》（1890）",
                "label": "《谢尔曼法》（1890）"
              },
              {
                "value": "《克莱顿法》（1914）",
                "label": "《克莱顿法》（1914）"
              },
              {
                "value": "《塞勒——凯弗维尔反兼并法》（1950）",
                "label": "《塞勒——凯弗维尔反兼并法》（1950）"
              },
              {
                "value": "《哈特—斯科特—罗迪诺反托拉斯改进法》（1976）",
                "label": "《哈特—斯科特—罗迪诺反托拉斯改进法》（1976）"
              },
              {
                "value": "《反托拉斯程序修订法》（1980）",
                "label": "《反托拉斯程序修订法》（1980）"
              }
            ]
          },
          {
            "value": "州",
            "label": "州",
            "children": [
              {
                "value": "反垄断",
                "label": "反垄断",
                "children": [
                  {
                    "value": "《纽约州特许经营法》",
                    "label": "《纽约州特许经营法》"
                  },
                  {
                    "value": "《纽约特许经营条例》",
                    "label": "《纽约特许经营条例》"
                  },
                  {
                    "value": "联邦贸易委员会关于通过计算机软盘交付披露文件的第97-2号非正式工作人员咨询意见",
                    "label": "联邦贸易委员会关于通过计算机软盘交付披露文件的第97-2号非正式工作人员咨询意见"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "value": "争议解决",
        "label": "争议解决",
        "children": [
          {
            "value": "商务纠纷救济路径",
            "label": "商务纠纷救济路径",
            "children": [
              {
                "value": "适用法律的确定：合同规定",
                "label": "适用法律的确定：合同规定",
                "children": [
                  {
                    "value": "国际仲裁",
                    "label": "国际仲裁"
                  },
                  {
                    "value": "当地法院",
                    "label": "当地法院"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "value": "安全",
        "label": "安全",
        "children": [
          {
            "value": "投资安全审查：",
            "label": "投资安全审查："
          },
          {
            "value": "联邦",
            "label": "联邦"
          },
          {
            "value": "州（纽约州为例）",
            "label": "州（纽约州为例）",
            "children": [
              {
                "value": "2005《信息安全漏洞和通知法》",
                "label": "2005《信息安全漏洞和通知法》"
              },
              {
                "value": "2019《制止黑客攻击和改善电子数据法》",
                "label": "2019《制止黑客攻击和改善电子数据法》"
              }
            ]
          }
        ]
      },
      {
        "value": "（基与美国特殊性）补充：国际组织",
        "label": "（基与美国特殊性）补充：国际组织",
        "children": [
          {
            "value": "联合国",
            "label": "联合国",
            "children": [
              {
                "value": "1. 国际民用航空组织（icao)",
                "label": "1. 国际民用航空组织（ICAO)"
              },
              {
                "value": "2. 国际农业发展基金（ifad)",
                "label": "2. 国际农业发展基金（IFAD)"
              },
              {
                "value": "3. 国际劳工组织（ilo)",
                "label": "3. 国际劳工组织（ILO)"
              },
              {
                "value": "4. 国际货币基金组织（imf)",
                "label": "4. 国际货币基金组织（IMF)"
              },
              {
                "value": "5. 国际海事组织（imo）",
                "label": "5. 国际海事组织（IMO）"
              },
              {
                "value": "6. 国际电信联盟（itu）",
                "label": "6. 国际电信联盟（ITU）"
              },
              {
                "value": "7. 联合国教科文组织",
                "label": "7. 联合国教科文组织"
              },
              {
                "value": "8.联合国粮食及农业组织unfao",
                "label": "8.联合国粮食及农业组织UNFAO"
              },
              {
                "value": "9. 联合国工业发展组织(unido)",
                "label": "9. 联合国工业发展组织(UNIDO)"
              },
              {
                "value": "1 0世界旅游组织（unwto)",
                "label": "1 0世界旅游组织（UNWTO)"
              },
              {
                "value": "11万国邮政联1. 盟(upu)",
                "label": "11万国邮政联1. 盟(UPU)"
              },
              {
                "value": "12世界银行2(wbg)",
                "label": "12世界银行2(WBG)"
              },
              {
                "value": "1 3世界卫生组3.织（who)",
                "label": "1 3世界卫生组3.织（WHO)"
              },
              {
                "value": "14世界知识产权组织（wipo)",
                "label": "14世界知识产权组织（WIPO)"
              },
              {
                "value": "1 5世界气象组5. 织（wmo)",
                "label": "1 5世界气象组5. 织（WMO)"
              }
            ]
          },
          {
            "value": "世界贸易组织",
            "label": "世界贸易组织"
          },
          {
            "value": "世界海关组织",
            "label": "世界海关组织",
            "children": [
              {
                "value": "海关国际条约",
                "label": "海关国际条约"
              },
              {
                "value": "协调制度公约",
                "label": "协调制度公约"
              }
            ]
          }
        ]
      }
    ]
  }
]);
</script>